------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\maris\Dropbox\Grad\582 - Metrics I\ECON-582---K
> rueger-Replication\Analysis/Log-TablesAndFigures.txt
  log type:  text
 opened on:  24 Nov 2019, 13:22:58

. 
. use "./Raw Data/STAR_Students.dta"

. 
. ****************************************************************************
> ****
. * I. Create / Reformat Variables
. ****************************************************************************
> ****
. 
. * Rename gk variables as g0 to make loops possible later on
. local k = "freelunch classtype classsize tmathss wordskillss treadss trace t
> highdegree schid tchid tyears tgen"

. foreach var of local k{
  2.    rename gk`var' g0`var'
  3. }

. 
. * Create gradeenter as when a student entered TNSTAR
. qui gen gradeenter = 0 if flagsgk == 1

.  qui replace gradeenter = 1 if flagsgk == 0 & flagsg1 == 1

.  qui replace gradeenter = 2 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 1 

.  qui replace gradeenter = 3 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 0 & 
> flagsg3 == 1 

. 
. * Create White/Asian indicator
. qui gen WhiteAsian = 1 if race == 1 | race == 3

.  qui replace WhiteAsian = 0 if WhiteAsian == . & race != .

. 
. * Create Age as of September 1st, 1985 (start of 1985 school year)
. qui gen bday = mdy(birthmonth, birthday, birthyear)

. qui gen startschool = mdy(9,1,1985)

. qui gen age = (startschool - bday)/365

.  qui replace age = 1985 - birthyear if age == .

. 
. * Redefine free lunch as (0 1) instead of (1 2)
. local freelunch = "g0freelunch g1freelunch g2freelunch g3freelunch"

. foreach var of local freelunch {
  2.  qui gen `var'_2 = .  if `var'== .  
  3.   qui replace `var'_2 = 0 if `var' == 2
  4.   qui replace `var'_2 = 1 if `var' == 1
  5. }

. 
. * Redefine gender as (0-male,1-female) instead of (1,2) 
. qui gen girl = gender - 1

. 
. * Create Attrition rate: percent that exits sample before completing third g
> rade. 
. * K:
. qui gen g0attrition = 1 if flagsgk == 1 & flagsg1 == 0 | flagsg2 == 0 | flag
> sg3 == 0 

.  qui replace g0attrition = 0 if g0attrition == .

. * 1:
. qui gen g1attrition = 1 if flagsg1 == 1 & flagsg2 == 0 | flagsg3 == 0 

.  qui replace g1attrition = 0 if g1attrition == .

. * 2:
. qui gen g2attrition = 1 if flagsg2 == 1 & flagsg3 == 0 

.  qui replace g2attrition = 0 if g2attrition == .

. * 3:
. qui gen g3attrition = 0

. 
. * Create variable: Percentile Score as SAT average for reading, math, and li
> stening
. forvalues i == 0/3 {
  2. 
.         foreach sub in `i'tread `i'tmath `i'wordskill {
  3.                 cumul g`sub'ss if inrange(g`i'classtype,2,3), gen(g`sub'x
> t)
  4.                 sort g`sub'ss
  5.                 qui replace g`sub'xt=g`sub'xt[_n-1] if g`sub'ss==g`sub'ss
> [_n-1] & g`i'classtype==1
  6.                 qui ipolate g`sub'xt g`sub'ss, gen(ipo)
  7.                 qui replace g`sub'xt=ipo if g`i'classtype==1 & mi(g`sub'x
> t)
  8.                 drop ipo
  9.         }
 10.         qui egen g`i'SAT = rmean(g`i'treadxt g`i'tmathxt g`i'wordskillxt)
 11.          qui replace g`i'SAT=100*g`i'SAT
 12. }

. 
. * Create indicator for white teacher 
. forvalues i == 0/3 {
  2.         qui gen g`i'twhite = 1 if g`i'trace == 1
  3.          qui replace g`i'twhite = 0 if g`i'twhite==. & g`i'trace != .
  4. }

. 
. * Create indicator for teacher with master's degree or higher
. forvalues i == 0/3 {
  2.         qui gen g`i'md = 1 if g`i'thighdegree == 3 | g`i'thighdegree == 4
>  | g`i'thighdegree == 5 | g`i'thighdegree == 6
  3.          qui replace g`i'md = 0 if g`i'md==. & g`i'thighdegree != .
  4. }

. 
. * Create White Teacher indicator
. forvalues i == 0/3 {
  2.         qui gen WhiteTeacher`i' = 1 if g`i'trace == 1
  3.          qui replace WhiteTeacher`i' = 0 if WhiteTeacher`i' == . & g`i'tr
> ace != .
  4. }

. 
. * Create Male Teacher indicator
. forvalues i == 0/3 {
  2.         qui gen MaleTeacher`i' = 1 if g`i'tgen == 1
  3.          qui replace MaleTeacher`i' = 0 if MaleTeacher`i' == . & g`i'tgen
>  != .
  4. }

. 
. * Create Indicator for small class, regular class, and regular+aide (needed 
> for II, V, and VII)
. forvalues i == 0/3{
  2.         qui gen g`i's = 1 if g`i'classtype==1
  3.          qui replace g`i's = 0 if g`i's == . & g`i'classtype != .
  4. 
.         qui gen g`i'r = 1 if g`i'classtype==2
  5.          qui replace g`i'r = 0 if g`i'r == . & g`i'classtype != .
  6. 
.         qui gen g`i'ra = 1 if g`i'classtype==3
  7.          qui replace g`i'ra = 0 if g`i'ra == . & g`i'classtype !=  .
  8. }

. 
. * Create Indicator for students' initial assignment the first year they ente
> red the program (needed for Reduced Form in V)
. qui gen fyclasstype = .

. forvalues i == 0/3 {
  2.         qui replace fyclasstype = g`i'classtype if gradeenter == `i'
  3. }

. 
. qui gen initials = 1 if fyclasstype==1

.  qui replace initials = 0 if initials == . & fyclasstype != .

. 
. qui gen initialra = 1 if fyclasstype==3

.  qui replace initialra = 0 if initialra == . & fyclasstype !=  .

.  
. 
. *save "./Output/Data/CleanData.dta", replace
. 
. 
. ****************************************************************************
> ****
. * II. Tables and Figures
. ****************************************************************************
> ****
. 
. ****************************************************************************
> ****
. * II.a Table 1
. ****************************************************************************
> ****
. forvalues i == 0/2 {
  2.         local g`i'list = "g`i'freelunch_2 WhiteAsian age g`i'attrition g`
> i'classsize g`i'SAT"
  3. }

.         local g3list = "g3freelunch_2 WhiteAsian age g3classsize g3SAT"

.         
. forvalues i == 0/3 {
  2.    qui tabstat g`i'freelunch_2 WhiteAsian age g`i'attrition g`i'classsize
>  g`i'SAT if gradeenter == `i', by(g`i'classtype) stat(mean) nototal save
  3.    qui tabstatmat g`i'means
  4.    
.    forvalues r == 1/3{
  5.           matrix g`i'means[`r',1] = round(g`i'means[`r',1], 0.001)
  6.          
.          forvalues c == 1/6{
  7.             matrix g`i'means[`r',`c'] = round(g`i'means[`r',`c'], 0.001)
  8.             }
  9.          }
 10.  
.    matrix rownames g`i'means = Small Regular Regular/Aide
 11.    matrix rownames g`i'means = _:
 12.    matrix colnames g`i'means = "FreeLunch" "White/Asian" "Agein1985" "Att
> rition" "Class-Size" "Percentile"
 13.    matrix list g`i'means
 14.    
.    outtable using "./Output/Table 1/Table1_`i'.tex", replace mat(g`i'means) 
> nobox 
 15.         
.           foreach var of local g`i'list { 
 16.         
.             qui mvtest means `var' if gradeenter == `i', by(g`i'classtype)  
>     
 17.                 }
 18. }

g0means[3,6]
                FreeLunch  White/Asian    Agein1985    Attrition   Class-Size
       Small         .471         .683        5.442         .487       15.117
     Regular         .477         .675        5.426         .518       22.383
Regular/Aide         .503         .659        5.432         .529       22.774

               Percentile
       Small       54.728
     Regular       49.928
Regular/Aide       50.011

g1means[3,6]
                FreeLunch  White/Asian    Agein1985    Attrition   Class-Size
       Small         .592         .622        5.778         .527        15.87
     Regular         .624         .562        5.858         .513        22.71
Regular/Aide         .607         .651        5.876         .468       23.457

               Percentile
       Small       49.502
     Regular       42.896
Regular/Aide       48.009

g2means[3,6]
                FreeLunch  White/Asian    Agein1985    Attrition   Class-Size
       Small         .655         .574        5.881         .369         15.5
     Regular         .633         .567        5.908         .336       23.714
Regular/Aide         .659         .465        5.939         .349       23.592

               Percentile
       Small       46.567
     Regular       45.449
Regular/Aide       41.889

g3means[3,6]
                FreeLunch  White/Asian    Agein1985    Attrition   Class-Size
       Small         .598         .668        5.952            0       15.971
     Regular         .645         .577        5.929            0       24.051
Regular/Aide         .686         .558        5.986            0       24.425

               Percentile
       Small       47.907
     Regular       44.521
Regular/Aide       41.578

. 
. matrix T1pval=(0.088, 0.518, 0.605, 0.038 \ 0.251, 0.000, 0.000, 0.003 \ 0.3
> 35, 0.033, 0.405, 0.498 \ 0.024, 0.069, 0.580, 0.000 \ 0.000, 0.000, 0.000, 
> 0.000 \ 0.000, 0.000, 0.010, 0.006)  

. matrix rownames T1pval = "FreeLunch" "White/Asian" "Agein1985" "Attrition" "
> Class-Size" "Percentile"

. matrix colnames T1pval = "K" "1" "2" "3"

. matrix list T1pval

T1pval[6,4]
                K     1     2     3
  FreeLunch  .088  .518  .605  .038
White/Asian  .251     0     0  .003
  Agein1985  .335  .033  .405  .498
  Attrition  .024  .069   .58     0
 Class-Size     0     0     0     0
 Percentile     0     0   .01  .006

. 
. outtable using "./Output/Table 1/Table1pval.tex", replace mat(T1pval) nobox 

.         
.         
. ****************************************************************************
> ****
. * II.b Table 2
. ****************************************************************************
> ****
. forvalues i == 0/3 {
  2.         
.         foreach var of local g`i'list { 
  3.                 areg `var' g`i's g`i'ra if gradeenter==`i', absorb(g`i'sc
> hid) 
  4.                 }
  5. }

Linear regression, absorbing indicators         Number of obs     =      6,300
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   6219)   =       0.81
                                                Prob > F          =     0.4459
                                                R-squared         =     0.3040
                                                Adj R-squared     =     0.2951
                                                Root MSE          =     0.4196

------------------------------------------------------------------------------
g0freelunc~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |  -.0018183   .0133761    -0.14   0.892      -.02804    .0244034
        g0ra |   .0133368   .0128584     1.04   0.300    -.0118701    .0385437
       _cons |   .4802888   .0090768    52.91   0.000      .462495    .4980825
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 6219) = 34.743           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      6,322
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   6241)   =       0.44
                                                Prob > F          =     0.6466
                                                R-squared         =     0.7368
                                                Adj R-squared     =     0.7334
                                                Root MSE          =     0.2424

------------------------------------------------------------------------------
  WhiteAsian |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |  -.0001902   .0077164    -0.02   0.980     -.015317    .0149366
        g0ra |  -.0061344   .0074166    -0.83   0.408    -.0206736    .0084047
       _cons |   .6741612   .0052378   128.71   0.000     .6638932    .6844292
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 6241) = 223.848          Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      6,317
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   6236)   =       0.83
                                                Prob > F          =     0.4375
                                                R-squared         =     0.0303
                                                Adj R-squared     =     0.0178
                                                Root MSE          =     0.3466

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   .0139283    .011039     1.26   0.207    -.0077119    .0355684
        g0ra |   .0088301    .010608     0.83   0.405    -.0119651    .0296254
       _cons |   5.425677   .0074927   724.13   0.000     5.410988    5.440365
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 6236) = 2.467            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      6,325
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   6244)   =       4.45
                                                Prob > F          =     0.0117
                                                R-squared         =     0.1432
                                                Adj R-squared     =     0.1322
                                                Root MSE          =     0.4657

------------------------------------------------------------------------------
 g0attrition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |  -.0372242   .0148156    -2.51   0.012    -.0662678   -.0081806
        g0ra |   .0025588   .0142425     0.18   0.857    -.0253614     .030479
       _cons |   .5228486    .010056    51.99   0.000     .5031354    .5425618
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 6244) = 13.270           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      6,325
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   6244)   =   24716.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9111
                                                Adj R-squared     =     0.9099
                                                Root MSE          =     1.1946

------------------------------------------------------------------------------
 g0classsize |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |  -7.210765   .0380091  -189.71   0.000    -7.285276   -7.136254
        g0ra |   .3205899   .0365389     8.77   0.000     .2489611    .3922188
       _cons |   22.39118   .0257985   867.93   0.000     22.34061    22.44175
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 6244) = 153.480          Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      5,901
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,   5820)   =      30.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2444
                                                Adj R-squared     =     0.2340
                                                Root MSE          =    23.3256

------------------------------------------------------------------------------
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   5.365558   .7694958     6.97   0.000      3.85706    6.874055
        g0ra |   .2353069    .737978     0.32   0.750    -1.211404    1.682018
       _cons |   49.70434   .5223259    95.16   0.000     48.68039    50.72829
------------------------------------------------------------------------------
F test of absorbed indicators: F(78, 5820) = 23.472           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,240
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2162)   =       1.23
                                                Prob > F          =     0.2923
                                                R-squared         =     0.2650
                                                Adj R-squared     =     0.2388
                                                Root MSE          =     0.4252

------------------------------------------------------------------------------
g1freelunc~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   -.041512   .0270356    -1.54   0.125    -.0945304    .0115065
        g1ra |  -.0048462   .0205618    -0.24   0.814    -.0451692    .0354767
       _cons |   .6208526   .0137945    45.01   0.000     .5938007    .6479046
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2162) = 10.371           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,285
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2207)   =       1.29
                                                Prob > F          =     0.2756
                                                R-squared         =     0.6113
                                                Adj R-squared     =     0.5977
                                                Root MSE          =     0.3099

------------------------------------------------------------------------------
  WhiteAsian |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   -.010046   .0194845    -0.52   0.606    -.0482558    .0281638
        g1ra |   .0184403   .0147932     1.25   0.213    -.0105697    .0474503
       _cons |   .6010653   .0099361    60.49   0.000     .5815802    .6205503
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2207) = 45.726           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,277
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2199)   =       2.12
                                                Prob > F          =     0.1203
                                                R-squared         =     0.0830
                                                Adj R-squared     =     0.0508
                                                Root MSE          =     0.6010

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |  -.0711537   .0378988    -1.88   0.061    -.1454749    .0031676
        g1ra |   .0040016   .0287319     0.14   0.889    -.0523429    .0603461
       _cons |   5.861833   .0193002   303.72   0.000     5.823985    5.899682
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2199) = 2.556            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,314
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2236)   =       0.99
                                                Prob > F          =     0.3700
                                                R-squared         =     0.1018
                                                Adj R-squared     =     0.0708
                                                Root MSE          =     0.4821

------------------------------------------------------------------------------
 g1attrition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   .0288894   .0301222     0.96   0.338     -.030181    .0879599
        g1ra |  -.0144861   .0228542    -0.63   0.526    -.0593037    .0303316
       _cons |   .4986856   .0153727    32.44   0.000     .4685394    .5288319
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2236) = 3.301            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,314
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2236)   =    5293.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8957
                                                Adj R-squared     =     0.8921
                                                Root MSE          =     1.1748

------------------------------------------------------------------------------
 g1classsize |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   -6.74577   .0734088   -91.89   0.000    -6.889727   -6.601814
        g1ra |    .627475   .0556964    11.27   0.000      .518253    .7366971
       _cons |   22.74093   .0374638   607.01   0.000     22.66746     22.8144
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2236) = 93.215           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      2,190
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,   2112)   =      10.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2392
                                                Adj R-squared     =     0.2114
                                                Root MSE          =    22.8523

------------------------------------------------------------------------------
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   5.873935   1.478651     3.97   0.000      2.97417    8.773699
        g1ra |   3.953181   1.115073     3.55   0.000     1.766425    6.139938
       _cons |   43.46734   .7471164    58.18   0.000     42.00218     44.9325
------------------------------------------------------------------------------
F test of absorbed indicators: F(75, 2112) = 8.412            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,592
Absorbed variable: g2schid                      No. of categories =         73
                                                F(   2,   1517)   =       0.55
                                                Prob > F          =     0.5787
                                                R-squared         =     0.3367
                                                Adj R-squared     =     0.3043
                                                Root MSE          =     0.3984

------------------------------------------------------------------------------
g2freelunc~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   .0105408   .0287629     0.37   0.714    -.0458784    .0669601
        g2ra |  -.0174309   .0243833    -0.71   0.475    -.0652595    .0303977
       _cons |   .6526221   .0168643    38.70   0.000     .6195424    .6857018
------------------------------------------------------------------------------
F test of absorbed indicators: F(72, 1517) = 10.674           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,590
Absorbed variable: g2schid                      No. of categories =         75
                                                F(   2,   1513)   =       0.34
                                                Prob > F          =     0.7101
                                                R-squared         =     0.7111
                                                Adj R-squared     =     0.6966
                                                Root MSE          =     0.2751

------------------------------------------------------------------------------
  WhiteAsian |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |  -.0161333   .0200978    -0.80   0.422    -.0555557    .0232892
        g2ra |  -.0029136   .0168289    -0.17   0.863    -.0359241    .0300969
       _cons |   .5328989   .0116215    45.85   0.000     .5101029    .5556948
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1513) = 49.584           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,673
Absorbed variable: g2schid                      No. of categories =         75
                                                F(   2,   1596)   =       0.83
                                                Prob > F          =     0.4346
                                                R-squared         =     0.1169
                                                Adj R-squared     =     0.0749
                                                Root MSE          =     0.6558

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |  -.0209696   .0464288    -0.45   0.652    -.1120374    .0700982
        g2ra |   .0344237   .0390499     0.88   0.378    -.0421709    .1110182
       _cons |   5.905671   .0270976   217.94   0.000      5.85252    5.958822
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1596) = 2.829            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,679
Absorbed variable: g2schid                      No. of categories =         75
                                                F(   2,   1602)   =       0.16
                                                Prob > F          =     0.8483
                                                R-squared         =     0.0494
                                                Adj R-squared     =     0.0043
                                                Root MSE          =     0.4756

------------------------------------------------------------------------------
 g2attrition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   .0192899   .0336332     0.57   0.566    -.0466799    .0852596
        g2ra |    .007493   .0282648     0.27   0.791    -.0479468    .0629328
       _cons |   .3412758   .0195937    17.42   0.000     .3028438    .3797078
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1602) = 1.110            Prob > F = 0.248

Linear regression, absorbing indicators         Number of obs     =      1,679
Absorbed variable: g2schid                      No. of categories =         75
                                                F(   2,   1602)   =    4694.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8963
                                                Adj R-squared     =     0.8914
                                                Root MSE          =     1.2861

------------------------------------------------------------------------------
 g2classsize |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |  -7.864634   .0909526   -86.47   0.000    -8.043032   -7.686235
        g2ra |   .0533084    .076435     0.70   0.486    -.0966147    .2032315
       _cons |   23.56898   .0529863   444.81   0.000     23.46506    23.67291
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1602) = 31.751           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,492
Absorbed variable: g2schid                      No. of categories =         74
                                                F(   2,   1416)   =       0.72
                                                Prob > F          =     0.4861
                                                R-squared         =     0.2453
                                                Adj R-squared     =     0.2053
                                                Root MSE          =    22.7383

------------------------------------------------------------------------------
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   1.823967   1.722507     1.06   0.290    -1.554972    5.202906
        g2ra |  -.0645885   1.438908    -0.04   0.964    -2.887209    2.758032
       _cons |   43.92697   .9921833    44.27   0.000     41.98066    45.87328
------------------------------------------------------------------------------
F test of absorbed indicators: F(73, 1416) = 6.149            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,202
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   2,   1126)   =       1.70
                                                Prob > F          =     0.1838
                                                R-squared         =     0.2739
                                                Adj R-squared     =     0.2256
                                                Root MSE          =     0.4211

------------------------------------------------------------------------------
g3freelunc~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |  -.0429008   .0335709    -1.28   0.202    -.1087693    .0229677
        g3ra |   .0157151   .0315899     0.50   0.619    -.0462666    .0776967
       _cons |   .6527533   .0219703    29.71   0.000      .609646    .6958607
------------------------------------------------------------------------------
F test of absorbed indicators: F(73, 1126) = 5.704            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,270
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,   1193)   =       1.00
                                                Prob > F          =     0.3693
                                                R-squared         =     0.7060
                                                Adj R-squared     =     0.6873
                                                Root MSE          =     0.2744

------------------------------------------------------------------------------
  WhiteAsian |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |  -.0030703   .0212079    -0.14   0.885    -.0446793    .0385386
        g3ra |  -.0256091   .0198273    -1.29   0.197    -.0645093    .0132911
       _cons |   .6068141   .0137561    44.11   0.000     .5798253     .633803
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1193) = 38.221           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,266
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,   1189)   =       0.74
                                                Prob > F          =     0.4765
                                                R-squared         =     0.1091
                                                Adj R-squared     =     0.0521
                                                Root MSE          =     0.6962

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |  -.0159818   .0535847    -0.30   0.766    -.1211129    .0891494
        g3ra |   .0441713   .0504544     0.88   0.381    -.0548182    .1431608
       _cons |      5.945   .0350373   169.68   0.000     5.876259    6.013742
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1189) = 1.948            Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,283
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,   1206)   =    6390.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9407
                                                Adj R-squared     =     0.9370
                                                Root MSE          =     1.0893

------------------------------------------------------------------------------
 g3classsize |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |  -8.072191    .083617   -96.54   0.000    -8.236242    -7.90814
        g3ra |   .2348235   .0783798     3.00   0.003     .0810476    .3885994
       _cons |   24.09809   .0544593   442.50   0.000     23.99124    24.20493
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1206) = 52.302           Prob > F = 0.000

Linear regression, absorbing indicators         Number of obs     =      1,110
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,   1033)   =       5.65
                                                Prob > F          =     0.0036
                                                R-squared         =     0.2161
                                                Adj R-squared     =     0.1584
                                                Root MSE          =    24.2651

------------------------------------------------------------------------------
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |   4.063951   2.023768     2.01   0.045     .0927864    8.035115
        g3ra |  -2.447185   1.892975    -1.29   0.196      -6.1617     1.26733
       _cons |   44.14057   1.329511    33.20   0.000     41.53172    46.74942
------------------------------------------------------------------------------
F test of absorbed indicators: F(74, 1033) = 3.682            Prob > F = 0.000

. 
. matrix T2pval=(0.446, 0.292, 0.579, 0.184 \ 0.647, 0.276, 0.710, 0.369 \ 0.4
> 38, 0.120, 0.435, 0.477 \ 0.012, 0.370, 0.848, 0.000 \ 0.000, 0.000, 0.000, 
> 0.000 \ 0.000, 0.000, 0.429, 0.004)  

. matrix rownames T2pval = "FreeLunch" "White/Asian" "Agein1985" "Attrition" "
> Class-Size" "Percentile"

. matrix colnames T2pval = "K" "1" "2" "3"

. matrix list T2pval

T2pval[6,4]
                K     1     2     3
  FreeLunch  .446  .292  .579  .184
White/Asian  .647  .276   .71  .369
  Agein1985  .438   .12  .435  .477
  Attrition  .012   .37  .848     0
 Class-Size     0     0     0     0
 Percentile     0     0  .429  .004

. 
. outtable using "./Output/Table 2/Table2pval.tex", replace mat(T2pval) nobox 

. 
.  
. ****************************************************************************
> ****
. * II.c Table 3
. ****************************************************************************
> ****
. qui tab g1classsize g1classtype, matcell(t3)

. matrix colnames t3 = "Small" "Regular" "Regular/Aide"

. matrix rownames t3 = "12" "13" "14" "15" "16" "17" "18" "19" "20" "21" "22" 
> "23" "24" "25" "26" "27" "28" "29" "30" 

. matrix list t3

t3[19,3]
           Small       Regular  Regular/Aide
12            24             0             0
13           182             0             0
14           252             0             0
15           465             0             0
16           256            16             0
17           561            17             0
18           108            36             0
19            57            76            57
20            20           200           120
21             0           378           378
22             0           594           330
23             0           437           460
24             0           384           264
25             0           175           225
26             0           130           234
27             0            54           108
28             0            28            56
29             0            29            58
30             0            30            30

. 
. outtable using "./Output/Table 3/Table3.tex", replace mat(t3) nobox 

. 
. qui tabstat g1classsize, by(g1classtype) stat(mean) nototal save

. qui tabstatmat t3mean

. forvalues r == 1/3{
  2.           matrix t3mean[`r',1] = round(t3mean[`r',1], 0.001)  
  3. }

. 
. matrix rownames t3mean = Small Regular Regular/Aide

. matrix rownames t3mean = _:

. matrix colnames t3mean = "Average Class Size"

. matrix list t3mean

t3mean[3,1]
              Average Cl~e
       Small        15.697
     Regular        22.697
Regular/Aide        23.436

. 
. outtable using "./Output/Table 3/Table3m.tex", replace mat(t3mean) nobox 

. 
. 
. ****************************************************************************
> ****
. *II.d Figure 1 
. ****************************************************************************
> ****
. forvalues n=0/3 {
  2.         twoway kdensity g`n'SAT if (g`n'classtype==1)|| kdensity g`n'SAT 
> if (g`n'classtype==2 | g`n'classtype==3), title("Average SAT Distributions f
> or Grade `n'") ytitle("Density") xtitle("SAT Percentile") legend(label(1 "Sm
> all Class") label(2 "Regular Class")) lpattern("solid" "dash") scheme(s1colo
> r)
  3.         
.         graph export "./Output/Figure 1/figure1_`n'.png", replace
  4. }
(file ./Output/Figure 1/figure1_0.png written in PNG format)
(file ./Output/Figure 1/figure1_1.png written in PNG format)
(file ./Output/Figure 1/figure1_2.png written in PNG format)
(file ./Output/Figure 1/figure1_3.png written in PNG format)

. 
. 
. ****************************************************************************
> ****
. * II.e Table 5
. ****************************************************************************
> ****
. label variable WhiteAsian "White/Asian"

. label variable girl "Girl"

. forvalues i == 0/3 {
  2.         label variable g`i's "Small Class"      
  3.         label variable g`i'ra "Regular + Aide Class"
  4.         label variable g`i'freelunch_2 "Free Lunch"
  5.         label variable WhiteTeacher`i' "White Teacher"
  6.         label variable MaleTeacher`i' "Male Teacher"
  7.         label variable g`i'tyears "Teacher Experience"
  8.         label variable g`i'md "Master's Degree"
  9.         label variable initials "Initial Assignment - Small Class"
 10.         label variable initialra "Initial Assignment - Regular Class"
 11.         label variable g`i'classsize "Class Size"
 12. }

. 
. 
. * OLS - Actual Class Size
.         * 1. Small Class, Regular/Aide class, no school FE. 
. forvalues i == 0/3 {
  2.         reg g`i'SAT g`i's g`i'ra, vce(cluster g`i'tchid)
  3.         est2vec table5a`i', replace vars(g`i's g`i'ra WhiteAsian girl g`i
> 'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md) name(Col1`i')
  4.  } 

Linear regression                               Number of obs     =      5,901
                                                F(2, 324)         =       3.47
                                                Prob > F          =     0.0324
                                                R-squared         =     0.0067
                                                Root MSE          =     26.567

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   4.799842    2.18771     2.19   0.029     .4959324    9.103751
        g0ra |     .08236   2.216627     0.04   0.970    -4.278439    4.443159
       _cons |   49.92827   1.654571    30.18   0.000     46.67321    53.18332
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,635
                                                F(2, 338)         =      10.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0176
                                                Root MSE          =     26.652

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   8.851231   1.951587     4.54   0.000     5.012445    12.69002
        g1ra |   3.504246   2.030623     1.73   0.085    -.4900038    7.498495
       _cons |   48.07066   1.401142    34.31   0.000      45.3146    50.82671
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,360
                                                F(2, 334)         =       4.96
                                                Prob > F          =     0.0075
                                                R-squared         =     0.0081
                                                Root MSE          =     26.389

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   5.676667   1.943013     2.92   0.004     1.854581    9.498753
        g2ra |   1.075384   2.029682     0.53   0.597    -2.917188    5.067956
       _cons |   49.19972   1.438038    34.21   0.000     46.37096    52.02847
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,354
                                                F(2, 333)         =       7.32
                                                Prob > F          =     0.0008
                                                R-squared         =     0.0104
                                                Root MSE          =     26.904

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |   5.638959   1.886125     2.99   0.003     1.928738     9.34918
        g3ra |  -.4007406   1.925072    -0.21   0.835    -4.187576    3.386095
       _cons |   49.57787   1.451588    34.15   0.000     46.72243    52.43331
------------------------------------------------------------------------------


.         * 2. Small Class, Regular/Aide class, school FE
. forvalues i == 0/3 {
  2.     areg g`i'SAT g`i's g`i'ra, vce(cluster g`i'tchid) absorb(g`i'schid)  
  3.         est2vec table5a`i', addto(table5a`i') name(Col2`i')
  4. }       

Linear regression, absorbing indicators         Number of obs     =      5,901
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,    324)   =      11.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2444
                                                Adj R-squared     =     0.2340
                                                Root MSE          =    23.3256

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   5.365558   1.263668     4.25   0.000     2.879528    7.851587
        g0ra |   .2353069   1.125552     0.21   0.835    -1.979005    2.449619
       _cons |   49.70434    .841239    59.08   0.000     48.04936    51.35932
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,635
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,    338)   =      26.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2349
                                                Adj R-squared     =     0.2260
                                                Root MSE          =    23.6534

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   8.553617   1.184712     7.22   0.000      6.22328    10.88395
        g1ra |    2.26824   .9740157     2.33   0.020     .3523437    4.184136
       _cons |   48.57213   .7216933    67.30   0.000     47.15255    49.99171
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,360
Absorbed variable: g2schid                      No. of categories =         74
                                                F(   2,    334)   =      13.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2099
                                                Adj R-squared     =     0.2005
                                                Root MSE          =    23.6878

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   6.165541   1.262125     4.89   0.000     3.682825    8.648258
        g2ra |   1.384078   1.117557     1.24   0.216    -.8142599    3.582415
       _cons |   48.94268   .8255736    59.28   0.000      47.3187    50.56666
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,354
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,    333)   =      16.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1696
                                                Adj R-squared     =     0.1595
                                                Root MSE          =    24.7892

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |   5.766126   1.186001     4.86   0.000     3.433128    8.099124
        g3ra |  -.1372458   1.100946    -0.12   0.901    -2.302931     2.02844
       _cons |   49.43737   .8388694    58.93   0.000     47.78721    51.08752
------------------------------------------------------------------------------


.         * 3. Small Class, Regular/Aide class, White/Asian, Girl, Free Lunch,
>  school FE
. forvalues i == 0/3 {
  2.         areg g`i'SAT g`i's g`i'ra  WhiteAsian girl g`i'freelunch_2, vce(c
> luster g`i'tchid) absorb(g`i'schid)
  3.         est2vec table5a`i', addto(table5a`i') name(Col3`i')
  4. }               

Linear regression, absorbing indicators         Number of obs     =      5,882
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   5,    324)   =      87.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3048
                                                Adj R-squared     =     0.2949
                                                Root MSE          =    22.3925

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   5.417803   1.218395     4.45   0.000     3.020839    7.814766
        g0ra |   .4794193   1.095078     0.44   0.662    -1.674941     2.63378
  WhiteAsian |   8.341964   1.353474     6.16   0.000     5.679258    11.00467
        girl |   4.424789   .6291299     7.03   0.000     3.187094    5.662484
g0freelunc~2 |  -13.14864   .7694027   -17.09   0.000    -14.66229   -11.63498
       _cons |   48.14235   1.299638    37.04   0.000     45.58556    50.69914
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,465
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   5,    336)   =      83.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2972
                                                Adj R-squared     =     0.2884
                                                Root MSE          =    22.6629

                              (Std. Err. adjusted for 337 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   7.924571   1.163143     6.81   0.000     5.636611    10.21253
        g1ra |   2.220646   .9730174     2.28   0.023     .3066722    4.134619
  WhiteAsian |   6.971871   1.183273     5.89   0.000     4.644314    9.299429
        girl |   3.791557   .5611091     6.76   0.000     2.687828    4.895286
g1freelunc~2 |  -13.46502   .8712979   -15.45   0.000    -15.17891   -11.75114
       _cons |   49.21466   1.311792    37.52   0.000      46.6343    51.79502
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,038
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   5,    324)   =      95.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2768
                                                Adj R-squared     =     0.2676
                                                Root MSE          =    22.6052

                              (Std. Err. adjusted for 325 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   5.715837   1.222342     4.68   0.000     3.311108    8.120566
        g2ra |   1.400608   1.080806     1.30   0.196    -.7256748     3.52689
  WhiteAsian |   6.387219    1.19846     5.33   0.000     4.029474    8.744964
        girl |   3.389552   .5988082     5.66   0.000     2.211509    4.567595
g2freelunc~2 |  -13.71942   .7187213   -19.09   0.000    -15.13337   -12.30547
       _cons |   50.25451   1.178378    42.65   0.000     47.93627    52.57275
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,163
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   5,    325)   =      78.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2225
                                                Adj R-squared     =     0.2125
                                                Root MSE          =    23.9598

                              (Std. Err. adjusted for 326 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |   5.089297   1.195594     4.26   0.000     2.737217    7.441377
        g3ra |  -.2682149   1.110539    -0.24   0.809    -2.452967    1.916537
  WhiteAsian |   6.145159   1.438322     4.27   0.000     3.315561    8.974756
        girl |    4.22768   .6525666     6.48   0.000     2.943892    5.511468
g3freelunc~2 |  -13.07023   .8147936   -16.04   0.000    -14.67317   -11.46729
       _cons |   50.14434   1.475553    33.98   0.000      47.2415    53.04718
------------------------------------------------------------------------------


.         * 4. Small Class, Regular/Aide class, White/Asian, Girl, Free Lunch,
>  White Teacher, Teacher Experience (gktyears), Teacher Male, Master's Degree
> , school FE
. forvalues i == 0/3 {
  2.         areg g`i'SAT g`i's g`i'ra WhiteAsian girl g`i'freelunch_2 WhiteTe
> acher`i' MaleTeacher`i' g`i'tyears g`i'md, vce(cluster g`i'tchid) absorb(g`i
> 'schid)
  3.         est2vec table5a`i', addto(table5a`i') name(Col4`i')
  4. }       
note: MaleTeacher0 omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =      5,839
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   8,    322)   =      54.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3086
                                                Adj R-squared     =     0.2983
                                                Root MSE          =    22.3541

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g0s |   5.351089   1.196647     4.47   0.000     2.996854    7.705323
        g0ra |   .2770256   1.066696     0.26   0.795    -1.821548    2.375599
  WhiteAsian |    8.39496    1.36163     6.17   0.000     5.716145    11.07378
        girl |   4.397897   .6293845     6.99   0.000     3.159672    5.636122
g0freelunc~2 |  -13.09892   .7730304   -16.94   0.000    -14.61974   -11.57809
WhiteTeach~0 |  -1.177618   2.165122    -0.54   0.587    -5.437189    3.081953
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2646266   .1052941     2.51   0.012     .0574753    .4717778
        g0md |  -.5950427   1.060651    -0.56   0.575    -2.681723    1.491638
       _cons |   47.03062   2.473241    19.02   0.000     42.16487    51.89637
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,452
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   9,    335)   =      51.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3001
                                                Adj R-squared     =     0.2909
                                                Root MSE          =    22.6278

                              (Std. Err. adjusted for 336 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g1s |   7.402965   1.179968     6.27   0.000     5.081885    9.724044
        g1ra |   1.774127   .9713782     1.83   0.069     -.136643    3.684896
  WhiteAsian |   6.962501   1.189645     5.85   0.000     4.622386    9.302616
        girl |   3.827535    .561256     6.82   0.000     2.723505    4.931565
g1freelunc~2 |  -13.60459   .8713667   -15.61   0.000    -15.31863   -11.89055
WhiteTeach~1 |  -4.174401   1.956578    -2.13   0.034    -8.023128   -.3256738
MaleTeacher1 |   11.61864   3.410409     3.41   0.001     4.910121    18.32715
    g1tyears |   .0536019   .0595785     0.90   0.369    -.0635932     .170797
        g1md |   .4944406   1.066086     0.46   0.643    -1.602626    2.591507
       _cons |   52.14636   2.391001    21.81   0.000     47.44309    56.84962
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      5,953
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   9,    319)   =      53.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2781
                                                Adj R-squared     =     0.2682
                                                Root MSE          =    22.5829

                              (Std. Err. adjusted for 320 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g2s |   5.752244   1.233751     4.66   0.000     3.324927    8.179561
        g2ra |   1.535954   1.067021     1.44   0.151    -.5633327    3.635241
  WhiteAsian |   6.419219   1.195225     5.37   0.000       4.0677    8.770737
        girl |   3.407041   .5992596     5.69   0.000     2.228041    4.586041
g2freelunc~2 |  -13.64178   .7203859   -18.94   0.000    -15.05909   -12.22448
WhiteTeach~2 |   .4127576   1.752523     0.24   0.814    -3.035206    3.860721
MaleTeacher2 |   1.341018   3.992076     0.34   0.737    -6.513106    9.195142
    g2tyears |   .0987907   .0648948     1.52   0.129    -.0288853    .2264666
        g2md |  -1.108026   1.065122    -1.04   0.299    -3.203576    .9875246
       _cons |   48.99669   2.229209    21.98   0.000     44.61088     53.3825
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,100
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   9,    322)   =      43.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2214
                                                Adj R-squared     =     0.2107
                                                Root MSE          =    23.9757

                              (Std. Err. adjusted for 323 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         g3s |   4.876533   1.203822     4.05   0.000     2.508183    7.244882
        g3ra |  -.7723032    1.07406    -0.72   0.473    -2.885364    1.340758
  WhiteAsian |   6.066275   1.442603     4.21   0.000     3.228157    8.904393
        girl |   4.190398   .6553503     6.39   0.000     2.901089    5.479707
g3freelunc~2 |  -12.88317   .8127695   -15.85   0.000    -14.48218   -11.28416
WhiteTeach~3 |   .5369259   1.759364     0.31   0.760    -2.924375    3.998226
MaleTeacher3 |  -7.412469   2.814632    -2.63   0.009    -12.94986   -1.875079
    g3tyears |    .036544   .0632657     0.58   0.564    -.0879223    .1610104
        g3md |   1.049501   1.158136     0.91   0.366    -1.228968     3.32797
       _cons |   49.21479   2.453804    20.06   0.000     44.38728     54.0423
------------------------------------------------------------------------------


. 
. * Reduced Form - Initial Class Size -- Class size from first appearance in T
> NSTAR; Outcome is average SAT percentile;  
.         * 5. Small Class, Regular/Aide class, no school FE
. forvalues i == 0/3 {
  2.         reg g`i'SAT initials initialra, vce(cluster g`i'tchid) 
  3.         est2vec table5b`i', replace vars(initials initialra WhiteAsian gi
> rl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md) name(Co
> l5`i')
  4. } 

Linear regression                               Number of obs     =      5,901
                                                F(2, 324)         =       3.47
                                                Prob > F          =     0.0324
                                                R-squared         =     0.0067
                                                Root MSE          =     26.567

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   4.799842    2.18771     2.19   0.029     .4959324    9.103751
   initialra |     .08236   2.216627     0.04   0.970    -4.278439    4.443159
       _cons |   49.92827   1.654571    30.18   0.000     46.67321    53.18332
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,635
                                                F(2, 338)         =       9.58
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0130
                                                Root MSE          =     26.714

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |    7.65886   1.752694     4.37   0.000     4.211299    11.10642
   initialra |   1.901863     1.1056     1.72   0.086    -.2728607    4.076586
       _cons |   49.06067   1.142908    42.93   0.000     46.81256    51.30878
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,360
                                                F(2, 334)         =       6.27
                                                Prob > F          =     0.0021
                                                R-squared         =     0.0079
                                                Root MSE          =     26.391

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.347542   1.657132     3.23   0.001     2.087812    8.607272
   initialra |  -.0850557   1.202591    -0.07   0.944    -2.450664    2.280552
       _cons |   49.93309   1.155653    43.21   0.000     47.65982    52.20637
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,354
                                                F(2, 333)         =      10.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0100
                                                Root MSE          =     26.908

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.891233   1.443183     4.08   0.000     3.052328    8.730139
   initialra |  -.4092809   1.153837    -0.35   0.723    -2.679009    1.860447
       _cons |   49.83303   1.025157    48.61   0.000     47.81643    51.84963
------------------------------------------------------------------------------


.         * 6. Small Class, Regular/Aide class, school FE
. forvalues i == 0/3 {
  2.     areg g`i'SAT initials initialra, vce(cluster g`i'tchid) absorb(g`i'sc
> hid)  
  3.         est2vec table5b`i', addto(table5b`i') name(Col6`i')
  4. }       

Linear regression, absorbing indicators         Number of obs     =      5,901
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   2,    324)   =      11.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2444
                                                Adj R-squared     =     0.2340
                                                Root MSE          =    23.3256

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.365558   1.263668     4.25   0.000     2.879528    7.851587
   initialra |   .2353069   1.125552     0.21   0.835    -1.979005    2.449619
       _cons |   49.70434    .841239    59.08   0.000     48.04936    51.35932
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,635
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   2,    338)   =      20.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2296
                                                Adj R-squared     =     0.2205
                                                Root MSE          =    23.7362

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   7.116566   1.125674     6.32   0.000     4.902357    9.330775
   initialra |   1.604528   .7982938     2.01   0.045     .0342781    3.174778
       _cons |   49.31082   .6750654    73.05   0.000     47.98296    50.63868
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,360
Absorbed variable: g2schid                      No. of categories =         74
                                                F(   2,    334)   =      13.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2082
                                                Adj R-squared     =     0.1988
                                                Root MSE          =    23.7130

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.623272   1.122381     5.01   0.000     3.415445    7.831098
   initialra |   1.076882     .85113     1.27   0.207    -.5973688    2.751133
       _cons |   49.43728   .7100722    69.62   0.000     48.04051    50.83406
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,354
Absorbed variable: g3schid                      No. of categories =         75
                                                F(   2,    333)   =      17.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1679
                                                Adj R-squared     =     0.1579
                                                Root MSE          =    24.8138

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.606346   1.048246     5.35   0.000     3.544328    7.668363
   initialra |   .0958272   .8319304     0.12   0.908    -1.540674    1.732329
       _cons |   49.72471   .6337033    78.47   0.000     48.47814    50.97127
------------------------------------------------------------------------------


.         * 7. Small Class, Regular/Aide class, White/Asian, Girl, Free Lunch,
>  school FE
. forvalues i == 0/3 {
  2.         areg g`i'SAT initials initialra WhiteAsian girl g`i'freelunch_2, 
> vce(cluster g`i'tchid) absorb(g`i'schid)
  3.         est2vec table5b`i', addto(table5b`i') name(Col7`i')
  4. }       

Linear regression, absorbing indicators         Number of obs     =      5,882
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   5,    324)   =      87.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3048
                                                Adj R-squared     =     0.2949
                                                Root MSE          =    22.3925

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.417803   1.218395     4.45   0.000     3.020839    7.814766
   initialra |   .4794193   1.095078     0.44   0.662    -1.674941     2.63378
  WhiteAsian |   8.341964   1.353474     6.16   0.000     5.679258    11.00467
        girl |   4.424789   .6291299     7.03   0.000     3.187094    5.662484
g0freelunc~2 |  -13.14864   .7694027   -17.09   0.000    -14.66229   -11.63498
       _cons |   48.14235   1.299638    37.04   0.000     45.58556    50.69914
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,465
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   5,    336)   =      81.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2931
                                                Adj R-squared     =     0.2842
                                                Root MSE          =    22.7296

                              (Std. Err. adjusted for 337 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   6.763326   1.101581     6.14   0.000     4.596463     8.93019
   initialra |   1.628313   .7564562     2.15   0.032     .1403267      3.1163
  WhiteAsian |    6.85486   1.181814     5.80   0.000     4.530173    9.179547
        girl |   3.756842   .5591879     6.72   0.000     2.656892    4.856792
g1freelunc~2 |  -13.62703    .873854   -15.59   0.000    -15.34595   -11.90812
       _cons |   50.01696   1.234596    40.51   0.000     47.58844    52.44547
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,038
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   5,    324)   =      92.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2756
                                                Adj R-squared     =     0.2663
                                                Root MSE          =    22.6251

                              (Std. Err. adjusted for 325 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.273872   1.093723     4.82   0.000     3.122177    7.425567
   initialra |   1.087339   .8042699     1.35   0.177    -.4949116    2.669589
  WhiteAsian |   6.302665    1.20712     5.22   0.000     3.927882    8.677448
        girl |   3.389415    .599659     5.65   0.000     2.209699    4.569132
g2freelunc~2 |  -13.84984     .72959   -18.98   0.000    -15.28517   -12.41451
       _cons |   50.83994   1.088107    46.72   0.000     48.69929    52.98059
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,163
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   5,    325)   =      78.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2219
                                                Adj R-squared     =     0.2119
                                                Root MSE          =    23.9681

                              (Std. Err. adjusted for 326 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.307603   1.027597     5.17   0.000     3.286021    7.329186
   initialra |   .0603337   .8020003     0.08   0.940    -1.517434    1.638101
  WhiteAsian |   5.996011   1.431171     4.19   0.000     3.180482    8.811541
        girl |   4.241851   .6545885     6.48   0.000     2.954085    5.529616
g3freelunc~2 |  -13.25895   .8181089   -16.21   0.000    -14.86841   -11.64949
       _cons |   50.44466   1.322004    38.16   0.000     47.84389    53.04543
------------------------------------------------------------------------------


.         * 8. Small Class, Regular/Aide class, White/Asian, Girl, Free Lunch,
>  White Teacher, Teacher Experience, Master's Degree, school FE
. forvalues i == 0/3 {
  2.         areg g`i'SAT initials initialra WhiteAsian girl g`i'freelunch_2 W
> hiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md, vce(cluster g`i'tchid) abso
> rb(g`i'schid)
  3.         est2vec table5b`i', addto(table5b`i') name(Col8`i')
  4. }       
note: MaleTeacher0 omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =      5,839
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   8,    322)   =      54.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3086
                                                Adj R-squared     =     0.2983
                                                Root MSE          =    22.3541

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.351089   1.196647     4.47   0.000     2.996854    7.705323
   initialra |   .2770256   1.066696     0.26   0.795    -1.821548    2.375599
  WhiteAsian |    8.39496    1.36163     6.17   0.000     5.716145    11.07378
        girl |   4.397897   .6293845     6.99   0.000     3.159672    5.636122
g0freelunc~2 |  -13.09892   .7730304   -16.94   0.000    -14.61974   -11.57809
WhiteTeach~0 |  -1.177618   2.165122    -0.54   0.587    -5.437189    3.081953
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2646266   .1052941     2.51   0.012     .0574753    .4717778
        g0md |  -.5950427   1.060651    -0.56   0.575    -2.681723    1.491638
       _cons |   47.03062   2.473241    19.02   0.000     42.16487    51.89637
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,452
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   9,    335)   =      50.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2966
                                                Adj R-squared     =     0.2873
                                                Root MSE          =    22.6849

                              (Std. Err. adjusted for 336 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   6.362894   1.109225     5.74   0.000      4.18097    8.544817
   initialra |   1.481116   .7596406     1.95   0.052    -.0131504    2.975383
  WhiteAsian |   6.840859   1.188548     5.76   0.000     4.502901    9.178817
        girl |    3.79818   .5594143     6.79   0.000     2.697772    4.898587
g1freelunc~2 |  -13.76842    .871951   -15.79   0.000    -15.48361   -12.05323
WhiteTeach~1 |  -4.293713   1.967629    -2.18   0.030    -8.164178   -.4232478
MaleTeacher1 |   12.86792   3.472702     3.71   0.000     6.036874    19.69897
    g1tyears |   .0629137   .0597038     1.05   0.293    -.0545279    .1803553
        g1md |    .645605   1.087429     0.59   0.553    -1.493445    2.784655
       _cons |   52.73827   2.339898    22.54   0.000     48.13552    57.34101
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      5,953
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   9,    319)   =      52.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2767
                                                Adj R-squared     =     0.2668
                                                Root MSE          =    22.6048

                              (Std. Err. adjusted for 320 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.238422   1.100542     4.76   0.000     3.073185    7.403659
   initialra |   1.162418   .8035793     1.45   0.149    -.4185668    2.743403
  WhiteAsian |   6.341642   1.203409     5.27   0.000     3.974022    8.709263
        girl |   3.404357   .6003628     5.67   0.000     2.223187    4.585528
g2freelunc~2 |  -13.76887   .7312456   -18.83   0.000    -15.20754   -12.33019
WhiteTeach~2 |   .4436612   1.766523     0.25   0.802    -3.031847    3.919169
MaleTeacher2 |   .8424422   4.251702     0.20   0.843    -7.522477    9.207362
    g2tyears |   .1027363   .0658806     1.56   0.120     -.026879    .2323517
        g2md |  -1.213393   1.057081    -1.15   0.252    -3.293124     .866338
       _cons |   49.58806     2.1989    22.55   0.000     45.26188    53.91424
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,100
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   9,    322)   =      43.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2204
                                                Adj R-squared     =     0.2098
                                                Root MSE          =    23.9907

                              (Std. Err. adjusted for 323 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    initials |   5.112877   1.051588     4.86   0.000     3.044027    7.181727
   initialra |  -.1483454   .7810551    -0.19   0.849    -1.684961     1.38827
  WhiteAsian |   5.919749   1.437722     4.12   0.000     3.091235    8.748264
        girl |   4.205228    .657581     6.39   0.000      2.91153    5.498926
g3freelunc~2 |  -13.07931   .8172073   -16.00   0.000    -14.68705   -11.47157
WhiteTeach~3 |   .0944154   1.757646     0.05   0.957    -3.363505    3.552336
MaleTeacher3 |  -6.828633   2.774707    -2.46   0.014    -12.28748    -1.36979
    g3tyears |   .0250844   .0633654     0.40   0.692    -.0995782    .1497469
        g3md |   .8290864   1.154097     0.72   0.473    -1.441437     3.09961
       _cons |   49.97763   2.301606    21.71   0.000     45.44955    54.50571
------------------------------------------------------------------------------


. 
. * Output OLS and Reduced table to latex. Have one table per grade.      
. forvalues i == 0/3 {
  2.         est2tex table5b`i', replace preserve path("./Output/Table 5/") ma
> rk(stars) levels(90 95 99) flexible(2) fancy label leadzero thousep collabel
> s("(1)" "(2)" "(3)" "(4)")
  3.         est2tex table5a`i', replace preserve path("./Output/Table 5/") ma
> rk(stars) levels(90 95 99) flexible(2) fancy label leadzero thousep collabel
> s("(1)" "(2)" "(3)" "(4)") 
  4. } 
matrix ./Output/Table 5/table5b0_tbl.dta saved
TeX file ./Output/Table 5/table5b0.tex saved
matrix ./Output/Table 5/table5a0_tbl.dta saved
TeX file ./Output/Table 5/table5a0.tex saved
matrix ./Output/Table 5/table5b1_tbl.dta saved
TeX file ./Output/Table 5/table5b1.tex saved
matrix ./Output/Table 5/table5a1_tbl.dta saved
TeX file ./Output/Table 5/table5a1.tex saved
matrix ./Output/Table 5/table5b2_tbl.dta saved
TeX file ./Output/Table 5/table5b2.tex saved
matrix ./Output/Table 5/table5a2_tbl.dta saved
TeX file ./Output/Table 5/table5a2.tex saved
matrix ./Output/Table 5/table5b3_tbl.dta saved
TeX file ./Output/Table 5/table5b3.tex saved
matrix ./Output/Table 5/table5a3_tbl.dta saved
TeX file ./Output/Table 5/table5a3.tex saved

. 
.   
. ****************************************************************************
> ****
. * II.f Table 7
. ****************************************************************************
> **** 
. 
. * OLS
. forvalues i == 0/3 {
  2.         areg g`i'SAT g`i'classsize WhiteAsian girl g`i'freelunch_2 WhiteT
> eacher`i' MaleTeacher`i' g`i'tyears g`i'md, vce(cluster g`i'tchid) absorb(g`
> i'schid)
  3.         est2vec table7`i', replace vars(g`i'classsize) name(Col1`i')
  4. } 
note: MaleTeacher0 omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =      5,839
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   7,    322)   =      59.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3075
                                                Adj R-squared     =     0.2972
                                                Root MSE          =    22.3705

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g0classsize |  -.6165089   .1379764    -4.47   0.000     -.887958   -.3450598
  WhiteAsian |   8.317694   1.366503     6.09   0.000     5.629293     11.0061
        girl |   4.379446   .6308031     6.94   0.000      3.13843    5.620461
g0freelunc~2 |  -13.10254    .775738   -16.89   0.000     -14.6287   -11.57639
WhiteTeach~0 |  -.8883319   2.219126    -0.40   0.689    -5.254148    3.477484
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2741847   .1057567     2.59   0.010     .0661234    .4822461
        g0md |  -.8311022    1.05603    -0.79   0.432    -2.908691    1.246487
       _cons |   61.07383   3.873145    15.77   0.000     53.45397     68.6937
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,452
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   8,    335)   =      59.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2987
                                                Adj R-squared     =     0.2895
                                                Root MSE          =    22.6490

                              (Std. Err. adjusted for 336 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g1classsize |  -.8221404   .1326346    -6.20   0.000    -1.083042   -.5612388
  WhiteAsian |   7.081355   1.189565     5.95   0.000     4.741396    9.421313
        girl |   3.843889   .5624598     6.83   0.000     2.737491    4.950287
g1freelunc~2 |  -13.58528   .8726987   -15.57   0.000    -15.30194   -11.86862
WhiteTeach~1 |  -4.414543   1.975783    -2.23   0.026    -8.301048   -.5280385
MaleTeacher1 |   11.52937   2.848322     4.05   0.000     5.926518    17.13222
    g1tyears |     .07052    .059841     1.18   0.239    -.0471916    .1882315
        g1md |   .5172511   1.077909     0.48   0.632    -1.603072    2.637574
       _cons |   71.92413   3.291296    21.85   0.000     65.44992    78.39834
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      5,953
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   8,    319)   =      60.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2778
                                                Adj R-squared     =     0.2680
                                                Root MSE          =    22.5856

                              (Std. Err. adjusted for 320 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g2classsize |  -.5997893   .1271939    -4.72   0.000    -.8500342   -.3495443
  WhiteAsian |   6.499893   1.188606     5.47   0.000     4.161396     8.83839
        girl |   3.426836   .6002084     5.71   0.000     2.245969    4.607703
g2freelunc~2 |  -13.61744   .7215407   -18.87   0.000    -15.03702   -12.19786
WhiteTeach~2 |    .435042   1.758091     0.25   0.805    -3.023876     3.89396
MaleTeacher2 |   2.120798   4.399938     0.48   0.630    -6.535766    10.77736
    g2tyears |   .0899367   .0655375     1.37   0.171    -.0390037     .218877
        g2md |  -.8743991    1.06267    -0.82   0.411    -2.965126    1.216328
       _cons |   63.77962   3.468232    18.39   0.000     56.95612    70.60312
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,100
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   8,    322)   =      47.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2205
                                                Adj R-squared     =     0.2100
                                                Root MSE          =    23.9865

                              (Std. Err. adjusted for 323 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g3classsize |  -.5982613   .1270905    -4.71   0.000    -.8482939   -.3482287
  WhiteAsian |   6.055993   1.444765     4.19   0.000     3.213623    8.898363
        girl |   4.206583   .6554524     6.42   0.000     2.917073    5.496092
g3freelunc~2 |  -12.91753   .8135009   -15.88   0.000    -14.51798   -11.31708
WhiteTeach~3 |   .4061474   1.757606     0.23   0.817    -3.051695    3.863989
MaleTeacher3 |   -7.10104   2.903464    -2.45   0.015    -12.81319   -1.388886
    g3tyears |   .0322269   .0643911     0.50   0.617    -.0944535    .1589074
        g3md |   1.032561   1.169522     0.88   0.378    -1.268308    3.333431
       _cons |   63.33142   3.314278    19.11   0.000     56.81105    69.85179
------------------------------------------------------------------------------


. 
. * 2SLS 
. forvalues i == 0/3 {
  2.         ivregress 2sls g`i'SAT (g`i'classsize=i.g`i'classtype) WhiteAsian
>  girl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md i.g`i
> 'schid, vce(cluster g`i'tchid) 
  3.         est2vec table7`i', addto(table7`i') name(Col2`i')
  4. } 
note: MaleTeacher0 omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =      5,839
                                                  Wald chi2(85)   =    6944.07
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3073
                                                  Root MSE        =     22.207

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g0classsize |  -.7050993   .1408897    -5.00   0.000    -.9812381   -.4289604
  WhiteAsian |   8.300851   1.356177     6.12   0.000     5.642792    10.95891
        girl |   4.375969   .6254029     7.00   0.000     3.150202    5.601737
g0freelunc~2 |  -13.09679   .7690367   -17.03   0.000    -14.60407    -11.5895
WhiteTeach~0 |  -.9009382     2.2006    -0.41   0.682    -5.214035    3.412159
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2771692   .1051135     2.64   0.008     .0711506    .4831878
        g0md |  -.8084224   1.048651    -0.77   0.441    -2.863741    1.246896
             |
     g0schid |
     123056  |   16.59036   4.020897     4.13   0.000     8.709549    24.47118
     128068  |   16.71867   3.208239     5.21   0.000     10.43064    23.00671
     128076  |   7.428541   3.440714     2.16   0.031     .6848663    14.17222
     128079  |   9.199391   7.506524     1.23   0.220    -5.513126    23.91191
     130085  |   14.49132   3.097727     4.68   0.000     8.419889    20.56276
     159171  |    44.4107   4.814403     9.22   0.000     34.97465    53.84676
     161176  |   10.57837   3.669792     2.88   0.004     3.385714    17.77103
     161183  |   35.65299   3.821514     9.33   0.000     28.16296    43.14302
     162184  |   16.78349   5.257126     3.19   0.001     6.479717    27.08727
     164198  |   25.89933   5.500232     4.71   0.000     15.11907    36.67959
     165199  |   38.20081    5.99762     6.37   0.000     26.44569    49.95593
     166203  |   16.22818    5.02961     3.23   0.001     6.370325    26.08603
     168211  |   22.71332   4.878075     4.66   0.000     13.15247    32.27418
     168214  |   36.67979   3.016736    12.16   0.000      30.7671    42.59249
     169219  |   33.82906   3.026083    11.18   0.000     27.89804    39.76007
     169229  |   33.11991   4.224465     7.84   0.000     24.84011    41.39971
     169231  |   5.790841   3.513369     1.65   0.099    -1.095236    12.67692
     169280  |   29.31909   4.512826     6.50   0.000     20.47412    38.16407
     170295  |   28.98453   7.512816     3.86   0.000     14.25968    43.70938
     173312  |   45.06692   3.556924    12.67   0.000     38.09548    52.03837
     176329  |   38.91654   7.238211     5.38   0.000      24.7299    53.10317
     180344  |   30.16091   5.556007     5.43   0.000     19.27134    41.05049
     189378  |   9.657543   4.681609     2.06   0.039     .4817589    18.83333
     189382  |   25.74352   5.295324     4.86   0.000     15.36488    36.12216
     189396  |   11.47934   4.034435     2.85   0.004     3.571989    19.38668
     191411  |   20.53332   4.710986     4.36   0.000     11.29995    29.76668
     193422  |   33.81972   3.667516     9.22   0.000     26.63152    41.00792
     193423  |   28.09414   3.592535     7.82   0.000      21.0529    35.13538
     201449  |   37.61182   5.511065     6.82   0.000     26.81033    48.41331
     203452  |   20.62717   3.775226     5.46   0.000     13.22786    28.02648
     203457  |   34.60273   4.310704     8.03   0.000     26.15391    43.05156
     205488  |   26.80915   4.623116     5.80   0.000     17.74801    35.87029
     205489  |   22.45973   4.214628     5.33   0.000     14.19921    30.72025
     205490  |   8.539609   3.190177     2.68   0.007     2.286977    14.79224
     205491  |   16.09432    6.25777     2.57   0.010     3.829321    28.35933
     205492  |   38.14104   6.816694     5.60   0.000     24.78057    51.50152
     208501  |    20.1827    4.31227     4.68   0.000     11.73081    28.63459
     208503  |   5.777458   3.559677     1.62   0.105    -1.199381     12.7543
     209510  |   15.49002   5.253246     2.95   0.003     5.193852     25.7862
     212522  |   27.39232    4.98677     5.49   0.000     17.61843    37.16621
     215533  |   37.13417   4.160594     8.93   0.000     28.97955    45.28878
     216536  |    20.1097   4.055728     4.96   0.000     12.16062    28.05878
     218562  |   30.71517   6.442454     4.77   0.000     18.08819    43.34215
     221571  |  -2.862856   4.180926    -0.68   0.494    -11.05732    5.331608
     221574  |   7.425748   3.464733     2.14   0.032      .634995     14.2165
     225585  |   16.48732   5.345503     3.08   0.002     6.010329    26.96431
     228606  |   27.04327   6.609436     4.09   0.000     14.08901    39.99753
     230612  |   43.34501   3.446652    12.58   0.000      36.5897    50.10033
     231616  |   29.96725   4.462997     6.71   0.000     21.21993    38.71456
     234628  |   28.35028   3.705391     7.65   0.000     21.08785    35.61271
     244697  |    20.8274   5.413707     3.85   0.000     10.21673    31.43807
     244708  |   15.06084   3.985244     3.78   0.000     7.249903    22.87177
     244723  |   16.69996   4.190198     3.99   0.000     8.487325     24.9126
     244727  |   28.80433     6.0113     4.79   0.000     17.02239    40.58626
     244728  |   15.23126   4.245032     3.59   0.000     6.911146    23.55136
     244736  |   43.02092   4.443772     9.68   0.000     34.31129    51.73055
     244745  |   39.53891   4.410905     8.96   0.000      30.8937    48.18412
     244746  |   34.27553   8.013801     4.28   0.000     18.56877    49.98229
     244755  |   30.71288   5.541741     5.54   0.000     19.85127     41.5745
     244764  |   29.19316   5.727678     5.10   0.000     17.96712     40.4192
     244774  |    30.9791   5.269076     5.88   0.000      20.6519     41.3063
     244776  |   30.42632   5.202739     5.85   0.000     20.22914     40.6235
     244780  |   57.14324   8.962434     6.38   0.000     39.57719    74.70928
     244796  |   19.17346   4.407055     4.35   0.000     10.53579    27.81113
     244799  |   20.12328   4.228841     4.76   0.000     11.83491    28.41166
     244801  |   20.09176   4.954885     4.05   0.000     10.38037    29.80316
     244806  |   53.49114   5.866328     9.12   0.000     41.99335    64.98893
     244818  |   18.18968   3.711249     4.90   0.000     10.91576    25.46359
     244831  |   22.00752   9.077015     2.42   0.015     4.216898    39.79814
     244839  |   38.78607    6.38673     6.07   0.000     26.26831    51.30383
     252885  |   28.72917   5.593011     5.14   0.000     17.76707    39.69127
     253888  |   20.98205   4.044957     5.19   0.000     13.05408    28.91002
     257899  |   17.89199   3.815332     4.69   0.000     10.41408    25.36991
     257905  |   33.88388   3.430165     9.88   0.000     27.16088    40.60688
     259915  |   18.33388   5.133367     3.57   0.000     8.272664    28.39509
     261927  |   24.52929   4.010371     6.12   0.000     16.66911    32.38948
     262937  |   38.62015   3.810432    10.14   0.000     31.15184    46.08846
     264945  |   35.45897   3.458325    10.25   0.000     28.68078    42.23716
             |
       _cons |   36.82836   4.821313     7.64   0.000     27.37876    46.27796
------------------------------------------------------------------------------
Instrumented:  g0classsize
Instruments:   WhiteAsian girl g0freelunch_2 WhiteTeacher0 g0tyears g0md
               123056.g0schid 128068.g0schid 128076.g0schid 128079.g0schid
               130085.g0schid 159171.g0schid 161176.g0schid 161183.g0schid
               162184.g0schid 164198.g0schid 165199.g0schid 166203.g0schid
               168211.g0schid 168214.g0schid 169219.g0schid 169229.g0schid
               169231.g0schid 169280.g0schid 170295.g0schid 173312.g0schid
               176329.g0schid 180344.g0schid 189378.g0schid 189382.g0schid
               189396.g0schid 191411.g0schid 193422.g0schid 193423.g0schid
               201449.g0schid 203452.g0schid 203457.g0schid 205488.g0schid
               205489.g0schid 205490.g0schid 205491.g0schid 205492.g0schid
               208501.g0schid 208503.g0schid 209510.g0schid 212522.g0schid
               215533.g0schid 216536.g0schid 218562.g0schid 221571.g0schid
               221574.g0schid 225585.g0schid 228606.g0schid 230612.g0schid
               231616.g0schid 234628.g0schid 244697.g0schid 244708.g0schid
               244723.g0schid 244727.g0schid 244728.g0schid 244736.g0schid
               244745.g0schid 244746.g0schid 244755.g0schid 244764.g0schid
               244774.g0schid 244776.g0schid 244780.g0schid 244796.g0schid
               244799.g0schid 244801.g0schid 244806.g0schid 244818.g0schid
               244831.g0schid 244839.g0schid 252885.g0schid 253888.g0schid
               257899.g0schid 257905.g0schid 259915.g0schid 261927.g0schid
               262937.g0schid 264945.g0schid 2.g0classtype 3.g0classtype


Instrumental variables (2SLS) regression          Number of obs   =      6,452
                                                  Wald chi2(83)   =   18093.31
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2986
                                                  Root MSE        =     22.502

                              (Std. Err. adjusted for 336 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g1classsize |  -.8880691   .1451992    -6.12   0.000    -1.172654   -.6034839
  WhiteAsian |   7.089731   1.181542     6.00   0.000     4.773952     9.40551
        girl |   3.842166    .557867     6.89   0.000     2.748766    4.935565
g1freelunc~2 |   -13.5627   .8663341   -15.66   0.000    -15.26069   -11.86472
WhiteTeach~1 |  -4.398971    1.96016    -2.24   0.025    -8.240814   -.5571269
MaleTeacher1 |   11.09093   2.837163     3.91   0.000     5.530193    16.65167
    g1tyears |   .0694627   .0594632     1.17   0.243    -.0470831    .1860084
        g1md |   .5085544   1.067683     0.48   0.634    -1.584066    2.601175
             |
     g1schid |
     123056  |   7.962435   4.240738     1.88   0.060    -.3492587    16.27413
     128076  |  -3.038329   4.470325    -0.68   0.497    -11.80001    5.723348
     128079  |   5.946377    1.68202     3.54   0.000     2.649679    9.243075
     130085  |   23.41356   4.230558     5.53   0.000     15.12182    31.70531
     159171  |   18.58405   2.123637     8.75   0.000      14.4218     22.7463
     161176  |   10.86577   2.222268     4.89   0.000     6.510208    15.22134
     161183  |   27.26918   3.724667     7.32   0.000     19.96897     34.5694
     162184  |   16.63174   3.194357     5.21   0.000     10.37091    22.89256
     164198  |   9.594765   1.361719     7.05   0.000     6.925844    12.26369
     165199  |   27.53242   3.004699     9.16   0.000     21.64332    33.42152
     166203  |   -1.62231   4.201858    -0.39   0.699    -9.857799     6.61318
     168211  |   22.17746   1.442375    15.38   0.000     19.35046    25.00447
     168214  |   29.15609   1.989012    14.66   0.000      25.2577    33.05448
     169219  |   15.15249     3.9019     3.88   0.000     7.504902    22.80007
     169229  |   13.50949   3.603337     3.75   0.000     6.447084    20.57191
     169231  |   7.164995   4.172235     1.72   0.086    -1.012436    15.34243
     169280  |   17.99735   5.358403     3.36   0.001     7.495071    28.49962
     170295  |   30.06351     4.2031     7.15   0.000     21.82558    38.30143
     173312  |   18.59852   4.890087     3.80   0.000     9.014127    28.18292
     176329  |   21.50573   6.055502     3.55   0.000     9.637161    33.37429
     180344  |   17.38099   2.745588     6.33   0.000     11.99974    22.76225
     189378  |   10.90459   4.263073     2.56   0.011     2.549121    19.26006
     189382  |   16.96944   1.603556    10.58   0.000     13.82653    20.11236
     189396  |    9.78577   3.323189     2.94   0.003     3.272439     16.2991
     191411  |  -2.984642   1.982487    -1.51   0.132    -6.870246    .9009625
     193422  |   10.42492    1.45676     7.16   0.000     7.569725    13.28012
     193423  |   6.067078   2.956925     2.05   0.040     .2716126    11.86254
     201449  |   25.12328   3.643758     6.89   0.000     17.98165    32.26492
     203452  |   19.49556   5.297037     3.68   0.000     9.113554    29.87756
     203457  |   24.50061   2.743297     8.93   0.000     19.12385    29.87737
     205488  |   1.755347   3.850835     0.46   0.649    -5.792152    9.302845
     205490  |   25.76383   10.09111     2.55   0.011     5.985631    45.54204
     205491  |   14.68053   4.512264     3.25   0.001     5.836653     23.5244
     205492  |   7.135101   3.017666     2.36   0.018     1.220584    13.04962
     208501  |   8.416528   3.987936     2.11   0.035     .6003169    16.23274
     208503  |   3.397455    5.28912     0.64   0.521    -6.969029    13.76394
     209510  |   10.88096   2.052186     5.30   0.000     6.858752    14.90317
     212522  |   6.744298   4.765341     1.42   0.157    -2.595599     16.0842
     215533  |   20.71563   6.636269     3.12   0.002     7.708783    33.72248
     216537  |   17.38808   3.345797     5.20   0.000     10.83044    23.94572
     218562  |   21.18471   2.513989     8.43   0.000     16.25738    26.11203
     221571  |  -4.355936   3.852708    -1.13   0.258     -11.9071    3.195232
     221574  |   2.948337   3.579931     0.82   0.410    -4.068198    9.964872
     225585  |   3.104205   1.917575     1.62   0.105    -.6541719    6.862583
     228606  |   28.53018    1.83024    15.59   0.000     24.94298    32.11739
     230612  |    18.8629   3.335409     5.66   0.000     12.32562    25.40018
     231616  |   18.26581   6.328921     2.89   0.004     5.861353    30.67027
     234628  |   24.93107   4.517403     5.52   0.000     16.07712    33.78502
     244697  |   6.966958    3.24007     2.15   0.032     .6165372    13.31738
     244708  |   3.615873   3.888378     0.93   0.352    -4.005208    11.23695
     244723  |   3.152596    3.35091     0.94   0.347    -3.415066    9.720258
     244727  |   19.57853   2.769864     7.07   0.000      14.1497    25.00736
     244728  |  -3.390134   5.740995    -0.59   0.555    -14.64228     7.86201
     244736  |   .1870347   3.471993     0.05   0.957    -6.617947    6.992017
     244745  |    4.43268   2.593978     1.71   0.087    -.6514237    9.516783
     244746  |   18.50147   3.325089     5.56   0.000     11.98441    25.01852
     244755  |   2.521515   2.867646     0.88   0.379    -3.098969    8.141998
     244764  |   10.51449   6.458996     1.63   0.104    -2.144909    23.17389
     244774  |  -4.970285   4.697088    -1.06   0.290    -14.17641    4.235838
     244776  |  -2.181644   4.825406    -0.45   0.651    -11.63927    7.275979
     244780  |   -7.75589   4.114087    -1.89   0.059    -15.81935    .3075719
     244796  |   8.135573   2.473763     3.29   0.001     3.287086    12.98406
     244799  |   11.61185   3.204206     3.62   0.000     5.331725    17.89198
     244801  |  -3.436879   1.510335    -2.28   0.023    -6.397081   -.4766777
     244806  |   9.574138   3.674225     2.61   0.009     2.372789    16.77549
     244831  |  -1.268791   2.148335    -0.59   0.555    -5.479451    2.941869
     244839  |   20.49884   4.004518     5.12   0.000     12.65013    28.34755
     252885  |     15.022   1.647208     9.12   0.000     11.79353    18.25046
     253888  |   8.898297   2.974754     2.99   0.003     3.067887    14.72871
     257899  |   6.509235   2.845891     2.29   0.022     .9313917    12.08708
     257905  |   19.41713   2.840291     6.84   0.000     13.85026      24.984
     259915  |   3.182362   4.709006     0.68   0.499     -6.04712    12.41184
     261927  |   10.37848   2.190685     4.74   0.000     6.084811    14.67214
     262937  |     26.938   1.846417    14.59   0.000     23.31909    30.55691
     264945  |   21.32002   3.517646     6.06   0.000     14.42556    28.21448
             |
       _cons |   61.27609    3.74722    16.35   0.000     53.93167     68.6205
------------------------------------------------------------------------------
Instrumented:  g1classsize
Instruments:   WhiteAsian girl g1freelunch_2 WhiteTeacher1 MaleTeacher1
               g1tyears g1md 123056.g1schid 128076.g1schid 128079.g1schid
               130085.g1schid 159171.g1schid 161176.g1schid 161183.g1schid
               162184.g1schid 164198.g1schid 165199.g1schid 166203.g1schid
               168211.g1schid 168214.g1schid 169219.g1schid 169229.g1schid
               169231.g1schid 169280.g1schid 170295.g1schid 173312.g1schid
               176329.g1schid 180344.g1schid 189378.g1schid 189382.g1schid
               189396.g1schid 191411.g1schid 193422.g1schid 193423.g1schid
               201449.g1schid 203452.g1schid 203457.g1schid 205488.g1schid
               205490.g1schid 205491.g1schid 205492.g1schid 208501.g1schid
               208503.g1schid 209510.g1schid 212522.g1schid 215533.g1schid
               216537.g1schid 218562.g1schid 221571.g1schid 221574.g1schid
               225585.g1schid 228606.g1schid 230612.g1schid 231616.g1schid
               234628.g1schid 244697.g1schid 244708.g1schid 244723.g1schid
               244727.g1schid 244728.g1schid 244736.g1schid 244745.g1schid
               244746.g1schid 244755.g1schid 244764.g1schid 244774.g1schid
               244776.g1schid 244780.g1schid 244796.g1schid 244799.g1schid
               244801.g1schid 244806.g1schid 244831.g1schid 244839.g1schid
               252885.g1schid 253888.g1schid 257899.g1schid 257905.g1schid
               259915.g1schid 261927.g1schid 262937.g1schid 264945.g1schid
               2.g1classtype 3.g1classtype

note: 161176.g2schid identifies no observations in the sample
note: 168211.g2schid identifies no observations in the sample
note: 212522.g2schid identifies no observations in the sample

Instrumental variables (2SLS) regression          Number of obs   =      5,953
                                                  Wald chi2(79)   =    4434.08
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2778
                                                  Root MSE        =     22.433

                              (Std. Err. adjusted for 320 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g2classsize |  -.6125283   .1315842    -4.66   0.000    -.8704286    -.354628
  WhiteAsian |   6.501376   1.178217     5.52   0.000     4.192113     8.81064
        girl |   3.426707   .5952109     5.76   0.000     2.260115    4.593299
g2freelunc~2 |  -13.61368   .7162344   -19.01   0.000    -15.01748   -12.20989
WhiteTeach~2 |   .4326687   1.743324     0.25   0.804    -2.984183     3.84952
MaleTeacher2 |   2.185133   4.369879     0.50   0.617    -6.379672    10.74994
    g2tyears |   .0895967    .065002     1.38   0.168    -.0378049    .2169983
        g2md |  -.8662536   1.056619    -0.82   0.412    -2.937189    1.204682
             |
     g2schid |
     123056  |   .2325793   4.849286     0.05   0.962    -9.271846    9.737005
     128076  |   6.904304   4.996597     1.38   0.167    -2.888847    16.69745
     128079  |  -3.612155   4.327351    -0.83   0.404    -12.09361    4.869297
     130085  |   17.69888   1.456839    12.15   0.000     14.84353    20.55423
     159171  |   6.976322   2.315914     3.01   0.003     2.437214    11.51543
     161176  |          0  (empty)
     161183  |   23.67628   3.425056     6.91   0.000      16.9633    30.38927
     162184  |   18.14723   6.044414     3.00   0.003     6.300399    29.99407
     164198  |    2.85989   2.146322     1.33   0.183    -1.346824    7.066604
     165199  |   16.37098   2.012443     8.13   0.000     12.42666    20.31529
     166203  |   9.382147   5.587869     1.68   0.093    -1.569875    20.33417
     168211  |          0  (empty)
     168214  |   14.98793   2.140717     7.00   0.000      10.7922    19.18365
     169219  |  -.4044118   6.173539    -0.07   0.948    -12.50433     11.6955
     169229  |   5.464057   2.588891     2.11   0.035     .3899236    10.53819
     169231  |  -2.775909   5.251253    -0.53   0.597    -13.06817    7.516358
     169280  |   10.10519   2.666062     3.79   0.000     4.879808    15.33058
     170295  |   14.26985   3.998649     3.57   0.000     6.432646    22.10706
     173312  |   20.47786   2.098694     9.76   0.000      16.3645    24.59122
     176329  |   3.847151   3.648998     1.05   0.292    -3.304753    10.99906
     189378  |   3.036105   2.720335     1.12   0.264    -2.295653    8.367864
     189382  |   1.022315   4.235638     0.24   0.809    -7.279383    9.324014
     189396  |   13.57808   3.042694     4.46   0.000     7.614508    19.54165
     191411  |   15.86275   4.800308     3.30   0.001     6.454321    25.27118
     193422  |   2.202658   5.233202     0.42   0.674    -8.054229    12.45955
     193423  |  -5.189659   4.408398    -1.18   0.239    -13.82996    3.450642
     201449  |   12.95684   2.878638     4.50   0.000     7.314815    18.59887
     203452  |   6.630968   2.967156     2.23   0.025     .8154495    12.44649
     203457  |   10.03283   3.813548     2.63   0.009     2.558414    17.50725
     205488  |  -3.473298   1.896765    -1.83   0.067    -7.190889    .2442925
     205490  |   5.293442   1.752987     3.02   0.003      1.85765    8.729235
     205491  |   6.147986   3.133914     1.96   0.050     .0056281    12.29034
     205492  |  -5.405806   8.069019    -0.67   0.503    -21.22079    10.40918
     208501  |   9.231336    3.04234     3.03   0.002      3.26846    15.19421
     208503  |   12.71286   3.120728     4.07   0.000     6.596348    18.82938
     209510  |   11.68442   2.649244     4.41   0.000     6.492002    16.87685
     212522  |          0  (empty)
     215533  |   2.446013   2.998203     0.82   0.415    -3.430356    8.322383
     216537  |   13.68465   2.169984     6.31   0.000     9.431557    17.93774
     218562  |   8.031739   4.118297     1.95   0.051    -.0399754    16.10345
     221571  |   2.487623   3.842903     0.65   0.517    -5.044329    10.01958
     221574  |  -5.346869   3.214643    -1.66   0.096    -11.64745    .9537161
     225585  |  -7.649237   2.697389    -2.84   0.005    -12.93602   -2.362452
     228606  |   19.48795   3.307722     5.89   0.000     13.00494    25.97097
     230612  |    .239247   3.468278     0.07   0.945    -6.558453    7.036947
     231616  |   20.98389   4.964702     4.23   0.000     11.25325    30.71452
     234628  |   9.338582   6.135382     1.52   0.128    -2.686546    21.36371
     244697  |   3.692252    4.48144     0.82   0.410    -5.091209    12.47571
     244708  |  -.2485925   4.983252    -0.05   0.960    -10.01559    9.518403
     244723  |   .0261816   4.844697     0.01   0.996    -9.469249    9.521613
     244727  |   .1661268   5.269377     0.03   0.975    -10.16166    10.49392
     244728  |  -12.15843   2.363446    -5.14   0.000     -16.7907   -7.526157
     244736  |  -10.40589   2.987838    -3.48   0.000    -16.26194   -4.549834
     244745  |  -5.565266   3.434609    -1.62   0.105    -12.29698    1.166444
     244746  |    7.19643   5.828011     1.23   0.217    -4.226261    18.61912
     244755  |  -1.699908   3.514979    -0.48   0.629    -8.589139    5.189324
     244764  |   12.99833   3.265297     3.98   0.000     6.598463    19.39819
     244774  |  -11.40363   2.908547    -3.92   0.000    -17.10428   -5.702985
     244776  |   1.259938   4.586307     0.27   0.784    -7.729058    10.24893
     244780  |  -4.183925   4.113393    -1.02   0.309    -12.24603    3.878177
     244796  |     .12574   2.561835     0.05   0.961    -4.895364    5.146844
     244799  |     -6.559   4.077072    -1.61   0.108    -14.54992    1.431915
     244801  |  -5.853611   3.250397    -1.80   0.072    -12.22427    .5170504
     244806  |   8.992089   3.454848     2.60   0.009     2.220711    15.76347
     244831  |   3.831991   4.870307     0.79   0.431    -5.713635    13.37762
     244839  |   10.78019   5.173165     2.08   0.037     .6409764    20.91941
     252885  |   12.71325   2.568858     4.95   0.000     7.678385    17.74812
     253888  |    1.88085   2.877959     0.65   0.513    -3.759845    7.521545
     257899  |   9.158456   5.029313     1.82   0.069    -.6988154    19.01573
     257905  |    7.46461    4.17164     1.79   0.074    -.7116538    15.64087
     259915  |  -5.228304   6.094843    -0.86   0.391    -17.17398    6.717368
     261927  |    9.53152   1.920322     4.96   0.000     5.767759    13.29528
     262937  |   18.41661   1.575646    11.69   0.000      15.3284    21.50482
     264945  |   2.193262   3.218359     0.68   0.496    -4.114606     8.50113
             |
       _cons |   58.79687   4.137909    14.21   0.000     50.68672    66.90702
------------------------------------------------------------------------------
Instrumented:  g2classsize
Instruments:   WhiteAsian girl g2freelunch_2 WhiteTeacher2 MaleTeacher2
               g2tyears g2md 123056.g2schid 128076.g2schid 128079.g2schid
               130085.g2schid 159171.g2schid 161183.g2schid 162184.g2schid
               164198.g2schid 165199.g2schid 166203.g2schid 168214.g2schid
               169219.g2schid 169229.g2schid 169231.g2schid 169280.g2schid
               170295.g2schid 173312.g2schid 176329.g2schid 189378.g2schid
               189382.g2schid 189396.g2schid 191411.g2schid 193422.g2schid
               193423.g2schid 201449.g2schid 203452.g2schid 203457.g2schid
               205488.g2schid 205490.g2schid 205491.g2schid 205492.g2schid
               208501.g2schid 208503.g2schid 209510.g2schid 215533.g2schid
               216537.g2schid 218562.g2schid 221571.g2schid 221574.g2schid
               225585.g2schid 228606.g2schid 230612.g2schid 231616.g2schid
               234628.g2schid 244697.g2schid 244708.g2schid 244723.g2schid
               244727.g2schid 244728.g2schid 244736.g2schid 244745.g2schid
               244746.g2schid 244755.g2schid 244764.g2schid 244774.g2schid
               244776.g2schid 244780.g2schid 244796.g2schid 244799.g2schid
               244801.g2schid 244806.g2schid 244831.g2schid 244839.g2schid
               252885.g2schid 253888.g2schid 257899.g2schid 257905.g2schid
               259915.g2schid 261927.g2schid 262937.g2schid 264945.g2schid
               2.g2classtype 3.g2classtype

note: 230612.g3schid identifies no observations in the sample

Instrumental variables (2SLS) regression          Number of obs   =      6,100
                                                  Wald chi2(81)   =    2789.67
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2204
                                                  Root MSE        =     23.826

                              (Std. Err. adjusted for 323 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g3classsize |  -.6592933   .1288622    -5.12   0.000    -.9118587    -.406728
  WhiteAsian |   6.060738   1.435551     4.22   0.000     3.247109    8.874367
        girl |   4.201543   .6500077     6.46   0.000     2.927551    5.475534
g3freelunc~2 |  -12.89971   .8081764   -15.96   0.000     -14.4837   -11.31571
WhiteTeach~3 |   .4598055   1.748578     0.26   0.793    -2.967345    3.886956
MaleTeacher3 |  -7.098117   2.882895    -2.46   0.014    -12.74849   -1.447746
    g3tyears |   .0343281   .0642102     0.53   0.593    -.0915216    .1601778
        g3md |   1.111519   1.160035     0.96   0.338    -1.162107    3.385145
             |
     g3schid |
     123056  |   5.325565    5.96599     0.89   0.372     -6.36756    17.01869
     128076  |  -2.034901   4.853118    -0.42   0.675    -11.54684    7.477036
     128079  |  -10.73973   4.802014    -2.24   0.025     -20.1515   -1.327951
     130085  |   12.87031   5.542219     2.32   0.020     2.007756    23.73286
     159171  |   2.125219   5.451591     0.39   0.697    -8.559703    12.81014
     161176  |   1.686127   4.810815     0.35   0.726    -7.742898    11.11515
     161183  |   4.434747   5.333793     0.83   0.406    -6.019295    14.88879
     162184  |   1.234285   5.968436     0.21   0.836    -10.46363     12.9322
     164198  |  -6.248001   4.458141    -1.40   0.161     -14.9858    2.489795
     165199  |   8.572962   6.371693     1.35   0.178    -3.915328    21.06125
     166203  |   2.597993    7.74769     0.34   0.737     -12.5872    17.78319
     168211  |   4.868862   4.546474     1.07   0.284    -4.042064    13.77979
     168214  |   11.92262   4.760297     2.50   0.012     2.592609    21.25263
     169219  |   5.627023   5.631233     1.00   0.318     -5.40999    16.66404
     169229  |   1.057226   4.820513     0.22   0.826    -8.390806    10.50526
     169231  |  -7.377033   4.734817    -1.56   0.119     -16.6571    1.903038
     169280  |  -1.422942   5.064236    -0.28   0.779    -11.34866    8.502778
     170295  |   4.047167   6.401561     0.63   0.527    -8.499663      16.594
     173312  |   7.045865   4.267227     1.65   0.099    -1.317747    15.40948
     176329  |  -2.434759   4.178536    -0.58   0.560    -10.62454     5.75502
     189378  |   5.026612   4.679862     1.07   0.283     -4.14575    14.19897
     189382  |   3.476876   5.722766     0.61   0.543     -7.73954    14.69329
     189396  |  -2.480143   5.423165    -0.46   0.647    -13.10935    8.149066
     191411  |  -3.613754    7.11517    -0.51   0.612    -17.55923    10.33172
     193422  |  -2.039703    5.89623    -0.35   0.729     -13.5961    9.516696
     193423  |   -4.41638   5.971317    -0.74   0.460    -16.11995    7.287186
     201449  |   3.434614   4.179938     0.82   0.411    -4.757914    11.62714
     203452  |  -.3253889    4.25306    -0.08   0.939    -8.661233    8.010455
     203457  |   12.25579   5.625315     2.18   0.029     1.230371     23.2812
     205488  |   4.002327   4.319081     0.93   0.354    -4.462916    12.46757
     205490  |   7.262195   6.973771     1.04   0.298    -6.406146    20.93054
     205491  |   8.321522   4.606731     1.81   0.071    -.7075055    17.35055
     205492  |  -18.65573   4.849529    -3.85   0.000    -28.16063   -9.150829
     208501  |   15.11256   4.170365     3.62   0.000     6.938794    23.28632
     208503  |   8.806514   6.051912     1.46   0.146    -3.055016    20.66804
     209510  |   14.82955   4.861495     3.05   0.002       5.3012    24.35791
     212522  |  -7.326522   5.836963    -1.26   0.209    -18.76676    4.113714
     215533  |    .892926   5.270786     0.17   0.865    -9.437625    11.22348
     216537  |   .7221044   5.090559     0.14   0.887    -9.255207    10.69942
     218562  |   4.379873   5.843308     0.75   0.454    -7.072801    15.83255
     221571  |  -.6199064   4.790231    -0.13   0.897    -10.00859    8.768773
     221574  |  -2.518434   5.548314    -0.45   0.650    -13.39293    8.356062
     225585  |  -9.750101   4.116722    -2.37   0.018    -17.81873   -1.681474
     228606  |    14.0227   4.856947     2.89   0.004     4.503262    23.54214
     230612  |          0  (empty)
     231616  |   21.01913   6.553611     3.21   0.001     8.174286    33.86397
     234628  |  -.4819509   4.245188    -0.11   0.910    -8.802366    7.838464
     244697  |  -3.099963   6.711058    -0.46   0.644    -16.25339    10.05347
     244708  |    -10.998   5.251069    -2.09   0.036    -21.28991   -.7060971
     244723  |   1.379421   7.442266     0.19   0.853    -13.20715    15.96599
     244727  |   2.444752   5.151454     0.47   0.635    -7.651913    12.54142
     244728  |  -11.42438   4.180183    -2.73   0.006    -19.61738   -3.231367
     244736  |  -9.272515   6.714216    -1.38   0.167    -22.43214    3.887106
     244745  |  -11.92977   5.037613    -2.37   0.018    -21.80331   -2.056226
     244746  |   5.538494   7.646252     0.72   0.469    -9.447884    20.52487
     244755  |  -5.661495   6.195832    -0.91   0.361     -17.8051    6.482112
     244764  |   5.340524   4.243328     1.26   0.208    -2.976247    13.65729
     244774  |  -10.40129   5.618949    -1.85   0.064    -21.41423    .6116462
     244776  |   5.564982   9.929429     0.56   0.575    -13.89634     25.0263
     244780  |   1.319884    6.79071     0.19   0.846    -11.98966    14.62943
     244796  |  -6.028783   4.966958    -1.21   0.225    -15.76384    3.706277
     244799  |   8.504752   6.916662     1.23   0.219    -5.051657    22.06116
     244801  |  -.7139072   8.695515    -0.08   0.935     -17.7568    16.32899
     244806  |  -3.901033    4.85509    -0.80   0.422    -13.41683    5.614769
     244831  |  -.6662807   5.609559    -0.12   0.905    -11.66082    10.32825
     244839  |   3.443728   6.425764     0.54   0.592    -9.150539    16.03799
     252885  |  -10.14204   6.164321    -1.65   0.100    -22.22388     1.93981
     253888  |   1.001581   4.860946     0.21   0.837    -8.525698    10.52886
     257899  |   6.280339   5.186916     1.21   0.226     -3.88583    16.44651
     257905  |   3.551238   4.453743     0.80   0.425    -5.177938    12.28041
     259915  |  -3.016298     4.3334    -0.70   0.486    -11.50961     5.47701
     261927  |   1.081935   4.220581     0.26   0.798    -7.190251    9.354121
     262937  |   13.37792    4.84237     2.76   0.006     3.887044    22.86879
     264945  |  -1.457835   4.390981    -0.33   0.740      -10.064    7.148329
             |
       _cons |   63.61606   5.509209    11.55   0.000     52.81821    74.41391
------------------------------------------------------------------------------
Instrumented:  g3classsize
Instruments:   WhiteAsian girl g3freelunch_2 WhiteTeacher3 MaleTeacher3
               g3tyears g3md 123056.g3schid 128076.g3schid 128079.g3schid
               130085.g3schid 159171.g3schid 161176.g3schid 161183.g3schid
               162184.g3schid 164198.g3schid 165199.g3schid 166203.g3schid
               168211.g3schid 168214.g3schid 169219.g3schid 169229.g3schid
               169231.g3schid 169280.g3schid 170295.g3schid 173312.g3schid
               176329.g3schid 189378.g3schid 189382.g3schid 189396.g3schid
               191411.g3schid 193422.g3schid 193423.g3schid 201449.g3schid
               203452.g3schid 203457.g3schid 205488.g3schid 205490.g3schid
               205491.g3schid 205492.g3schid 208501.g3schid 208503.g3schid
               209510.g3schid 212522.g3schid 215533.g3schid 216537.g3schid
               218562.g3schid 221571.g3schid 221574.g3schid 225585.g3schid
               228606.g3schid 231616.g3schid 234628.g3schid 244697.g3schid
               244708.g3schid 244723.g3schid 244727.g3schid 244728.g3schid
               244736.g3schid 244745.g3schid 244746.g3schid 244755.g3schid
               244764.g3schid 244774.g3schid 244776.g3schid 244780.g3schid
               244796.g3schid 244799.g3schid 244801.g3schid 244806.g3schid
               244831.g3schid 244839.g3schid 252885.g3schid 253888.g3schid
               257899.g3schid 257905.g3schid 259915.g3schid 261927.g3schid
               262937.g3schid 264945.g3schid 2.g3classtype 3.g3classtype


. 
. * Output table 7 to latex. Have one table per grade. 
. forvalues i == 0/3 {
  2.         est2tex table7`i', replace preserve path("./Output/Table 7") mark
> (stars) levels(90 95 99) flexible(2) fancy label leadzero thousep collabels(
> "(1)" "(2)" "(3)" "(4)")
  3. } 
matrix ./Output/Table 7/table70_tbl.dta saved
TeX file ./Output/Table 7/table70.tex saved
matrix ./Output/Table 7/table71_tbl.dta saved
TeX file ./Output/Table 7/table71.tex saved
matrix ./Output/Table 7/table72_tbl.dta saved
TeX file ./Output/Table 7/table72.tex saved
matrix ./Output/Table 7/table73_tbl.dta saved
TeX file ./Output/Table 7/table73.tex saved

. 
. 
. 
. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\6\STDbd4_000000.tmp"

. * II.f Table 7
. ****************************************************************************
> **** 
. 
. * OLS
. forvalues i == 0/3 {
  2.         areg g`i'SAT g`i'classsize WhiteAsian girl g`i'freelunch_2 WhiteT
> eacher`i' MaleTeacher`i' g`i'tyears g`i'md, vce(cluster g`i'tchid) absorb(g`
> i'schid)
  3.         est2vec table7`i', replace vars(g`i'classsize) name(Col1`i')
  4. } 
note: MaleTeacher0 omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =      5,839
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   7,    322)   =      59.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3075
                                                Adj R-squared     =     0.2972
                                                Root MSE          =    22.3705

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g0classsize |  -.6165089   .1379764    -4.47   0.000     -.887958   -.3450598
  WhiteAsian |   8.317694   1.366503     6.09   0.000     5.629293     11.0061
        girl |   4.379446   .6308031     6.94   0.000      3.13843    5.620461
g0freelunc~2 |  -13.10254    .775738   -16.89   0.000     -14.6287   -11.57639
WhiteTeach~0 |  -.8883319   2.219126    -0.40   0.689    -5.254148    3.477484
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2741847   .1057567     2.59   0.010     .0661234    .4822461
        g0md |  -.8311022    1.05603    -0.79   0.432    -2.908691    1.246487
       _cons |   61.07383   3.873145    15.77   0.000     53.45397     68.6937
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,452
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   8,    335)   =      59.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2987
                                                Adj R-squared     =     0.2895
                                                Root MSE          =    22.6490

                              (Std. Err. adjusted for 336 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g1classsize |  -.8221404   .1326346    -6.20   0.000    -1.083042   -.5612388
  WhiteAsian |   7.081355   1.189565     5.95   0.000     4.741396    9.421313
        girl |   3.843889   .5624598     6.83   0.000     2.737491    4.950287
g1freelunc~2 |  -13.58528   .8726987   -15.57   0.000    -15.30194   -11.86862
WhiteTeach~1 |  -4.414543   1.975783    -2.23   0.026    -8.301048   -.5280385
MaleTeacher1 |   11.52937   2.848322     4.05   0.000     5.926518    17.13222
    g1tyears |     .07052    .059841     1.18   0.239    -.0471916    .1882315
        g1md |   .5172511   1.077909     0.48   0.632    -1.603072    2.637574
       _cons |   71.92413   3.291296    21.85   0.000     65.44992    78.39834
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      5,953
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   8,    319)   =      60.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2778
                                                Adj R-squared     =     0.2680
                                                Root MSE          =    22.5856

                              (Std. Err. adjusted for 320 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g2classsize |  -.5997893   .1271939    -4.72   0.000    -.8500342   -.3495443
  WhiteAsian |   6.499893   1.188606     5.47   0.000     4.161396     8.83839
        girl |   3.426836   .6002084     5.71   0.000     2.245969    4.607703
g2freelunc~2 |  -13.61744   .7215407   -18.87   0.000    -15.03702   -12.19786
WhiteTeach~2 |    .435042   1.758091     0.25   0.805    -3.023876     3.89396
MaleTeacher2 |   2.120798   4.399938     0.48   0.630    -6.535766    10.77736
    g2tyears |   .0899367   .0655375     1.37   0.171    -.0390037     .218877
        g2md |  -.8743991    1.06267    -0.82   0.411    -2.965126    1.216328
       _cons |   63.77962   3.468232    18.39   0.000     56.95612    70.60312
------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,100
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   8,    322)   =      47.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2205
                                                Adj R-squared     =     0.2100
                                                Root MSE          =    23.9865

                              (Std. Err. adjusted for 323 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g3classsize |  -.5982613   .1270905    -4.71   0.000    -.8482939   -.3482287
  WhiteAsian |   6.055993   1.444765     4.19   0.000     3.213623    8.898363
        girl |   4.206583   .6554524     6.42   0.000     2.917073    5.496092
g3freelunc~2 |  -12.91753   .8135009   -15.88   0.000    -14.51798   -11.31708
WhiteTeach~3 |   .4061474   1.757606     0.23   0.817    -3.051695    3.863989
MaleTeacher3 |   -7.10104   2.903464    -2.45   0.015    -12.81319   -1.388886
    g3tyears |   .0322269   .0643911     0.50   0.617    -.0944535    .1589074
        g3md |   1.032561   1.169522     0.88   0.378    -1.268308    3.333431
       _cons |   63.33142   3.314278    19.11   0.000     56.81105    69.85179
------------------------------------------------------------------------------


. 
. * 2SLS 
. forvalues i == 0/3 {
  2.         ivregress 2sls g`i'SAT (g`i'classsize=i.fyclasstype) WhiteAsian g
> irl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md i.g`i's
> chid, vce(cluster g`i'tchid) 
  3.         est2vec table7`i', addto(table7`i') name(Col2`i')
  4. } 
note: MaleTeacher0 omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =      5,839
                                                  Wald chi2(85)   =    6944.07
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3073
                                                  Root MSE        =     22.207

                              (Std. Err. adjusted for 323 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 g0classsize |  -.7050993   .1408897    -5.00   0.000    -.9812381   -.4289604
  WhiteAsian |   8.300851   1.356177     6.12   0.000     5.642792    10.95891
        girl |   4.375969   .6254029     7.00   0.000     3.150202    5.601737
g0freelunc~2 |  -13.09679   .7690367   -17.03   0.000    -14.60407    -11.5895
WhiteTeach~0 |  -.9009382     2.2006    -0.41   0.682    -5.214035    3.412159
MaleTeacher0 |          0  (omitted)
    g0tyears |   .2771692   .1051135     2.64   0.008     .0711506    .4831878
        g0md |  -.8084224   1.048651    -0.77   0.441    -2.863741    1.246896
             |
     g0schid |
     123056  |   16.59036   4.020897     4.13   0.000     8.709549    24.47118
     128068  |   16.71867   3.208239     5.21   0.000     10.43064    23.00671
     128076  |   7.428541   3.440714     2.16   0.031     .6848663    14.17222
     128079  |   9.199391   7.506524     1.23   0.220    -5.513126    23.91191
     130085  |   14.49132   3.097727     4.68   0.000     8.419889    20.56276
     159171  |    44.4107   4.814403     9.22   0.000     34.97465    53.84676
     161176  |   10.57837   3.669792     2.88   0.004     3.385714    17.77103
     161183  |   35.65299   3.821514     9.33   0.000     28.16296    43.14302
     162184  |   16.78349   5.257126     3.19   0.001     6.479717    27.08727
     164198  |   25.89933   5.500232     4.71   0.000     15.11907    36.67959
     165199  |   38.20081    5.99762     6.37   0.000     26.44569    49.95593
     166203  |   16.22818    5.02961     3.23   0.001     6.370325    26.08603
     168211  |   22.71332   4.878075     4.66   0.000     13.15247    32.27418
     168214  |   36.67979   3.016736    12.16   0.000      30.7671    42.59249
     169219  |   33.82906   3.026083    11.18   0.000     27.89804    39.76007
     169229  |   33.11991   4.224465     7.84   0.000     24.84011    41.39971
     169231  |   5.790841   3.513369     1.65   0.099    -1.095236    12.67692
     169280  |   29.31909   4.512826     6.50   0.000     20.47412    38.16407
     170295  |   28.98453   7.512816     3.86   0.000     14.25968    43.70938
     173312  |   45.06692   3.556924    12.67   0.000     38.09548    52.03837
     176329  |   38.91654   7.238211     5.38   0.000      24.7299    53.10317
     180344  |   30.16091   5.556007     5.43   0.000     19.27134    41.05049
     189378  |   9.657543   4.681609     2.06   0.039     .4817589    18.83333
     189382  |   25.74352   5.295324     4.86   0.000     15.36488    36.12216
     189396  |   11.47934   4.034435     2.85   0.004     3.571989    19.38668
     191411  |   20.53332   4.710986     4.36   0.000     11.29995    29.76668
     193422  |   33.81972   3.667516     9.22   0.000     26.63152    41.00792
     193423  |   28.09414   3.592535     7.82   0.000      21.0529    35.13538
     201449  |   37.61182   5.511065     6.82   0.000     26.81033    48.41331
     203452  |   20.62717   3.775226     5.46   0.000     13.22786    28.02648
     203457  |   34.60273   4.310704     8.03   0.000     26.15391    43.05156
     205488  |   26.80915   4.623116     5.80   0.000     17.74801    35.87029
     205489  |   22.45973   4.214628     5.33   0.000     14.19921    30.72025
     205490  |   8.539609   3.190177     2.68   0.007     2.286977    14.79224
     205491  |   16.09432    6.25777     2.57   0.010     3.829321    28.35933
     205492  |   38.14104   6.816694     5.60   0.000     24.78057    51.50152
     208501  |    20.1827    4.31227     4.68   0.000     11.73081    28.63459
     208503  |   5.777458   3.559677     1.62   0.105    -1.199381     12.7543
     209510  |   15.49002   5.253246     2.95   0.003     5.193852     25.7862
     212522  |   27.39232    4.98677     5.49   0.000     17.61843    37.16621
     215533  |   37.13417   4.160594     8.93   0.000     28.97955    45.28878
     216536  |    20.1097   4.055728     4.96   0.000     12.16062    28.05878
     218562  |   30.71517   6.442454     4.77   0.000     18.08819    43.34215
     221571  |  -2.862856   4.180926    -0.68   0.494    -11.05732    5.331608
     221574  |   7.425748   3.464733     2.14   0.032      .634995     14.2165
     225585  |   16.48732   5.345503     3.08   0.002     6.010329    26.96431
     228606  |   27.04327   6.609436     4.09   0.000     14.08901    39.99753
     230612  |   43.34501   3.446652    12.58   0.000      36.5897    50.10033
     231616  |   29.96725   4.462997     6.71   0.000     21.21993    38.71456
     234628  |   28.35028   3.705391     7.65   0.000     21.08785    35.61271
     244697  |    20.8274   5.413707     3.85   0.000     10.21673    31.43807
     244708  |   15.06084   3.985244     3.78   0.000     7.249903    22.87177
     244723  |   16.69996   4.190198     3.99   0.000     8.487325     24.9126
     244727  |   28.80433     6.0113     4.79   0.000     17.02239    40.58626
     244728  |   15.23126   4.245032     3.59   0.000     6.911146    23.55136
     244736  |   43.02092   4.443772     9.68   0.000     34.31129    51.73055
     244745  |   39.53891   4.410905     8.96   0.000      30.8937    48.18412
     244746  |   34.27553   8.013801     4.28   0.000     18.56877    49.98229
     244755  |   30.71288   5.541741     5.54   0.000     19.85127     41.5745
     244764  |   29.19316   5.727678     5.10   0.000     17.96712     40.4192
     244774  |    30.9791   5.269076     5.88   0.000      20.6519     41.3063
     244776  |   30.42632   5.202739     5.85   0.000     20.22914     40.6235
     244780  |   57.14324   8.962434     6.38   0.000     39.57719    74.70928
     244796  |   19.17346   4.407055     4.35   0.000     10.53579    27.81113
     244799  |   20.12328   4.228841     4.76   0.000     11.83491    28.41166
     244801  |   20.09176   4.954885     4.05   0.000     10.38037    29.80316
     244806  |   53.49114   5.866328     9.12   0.000     41.99335    64.98893
     244818  |   18.18968   3.711249     4.90   0.000     10.91576    25.46359
     244831  |   22.00752   9.077015     2.42   0.015     4.216898    39.79814
     244839  |   38.78607    6.38673     6.07   0.000     26.26831    51.30383
     252885  |   28.72917   5.593011     5.14   0.000     17.76707    39.69127
     253888  |   20.98205   4.044957     5.19   0.000     13.05408    28.91002
     257899  |   17.89199   3.815332     4.69   0.000     10.41408    25.36991
     257905  |   33.88388   3.430165     9.88   0.000     27.16088    40.60688
     259915  |   18.33388   5.133367     3.57   0.000     8.272664    28.39509
     261927  |   24.52929   4.010371     6.12   0.000     16.66911    32.38948
     262937  |   38.62015   3.810432    10.14   0.000     31.15184    46.08846
     264945  |   35.45897   3.458325    10.25   0.000     28.68078    42.23716
             |
       _cons |   36.82836   4.821313     7.64   0.000     27.37876    46.27796
------------------------------------------------------------------------------
Instrumented:  g0classsize
Instruments:   WhiteAsian girl g0freelunch_2 WhiteTeacher0 g0tyears g0md
               123056.g0schid 128068.g0schid 128076.g0schid 128079.g0schid
               130085.g0schid 159171.g0schid 161176.g0schid 161183.g0schid
               162184.g0schid 164198.g0schid 165199.g0schid 166203.g0schid
               168211.g0schid 168214.g0schid 169219.g0schid 169229.g0schid
               169231.g0schid 169280.g0schid 170295.g0schid 173312.g0schid
               176329.g0schid 180344.g0schid 189378.g0schid 189382.g0schid
               189396.g0schid 191411.g0schid 193422.g0schid 193423.g0schid
               201449.g0schid 203452.g0schid 203457.g0schid 205488.g0schid
               205489.g0schid 205490.g0schid 205491.g0schid 205492.g0schid
               208501.g0schid 208503.g0schid 209510.g0schid 212522.g0schid
               215533.g0schid 216536.g0schid 218562.g0schid 221571.g0schid
               221574.g0schid 225585.g0schid 228606.g0schid 230612.g0schid
               231616.g0schid 234628.g0schid 244697.g0schid 244708.g0schid
               244723.g0schid 244727.g0schid 244728.g0schid 244736.g0schid
               244745.g0schid 244746.g0schid 244755.g0schid 244764.g0schid
               244774.g0schid 244776.g0schid 244780.g0schid 244796.g0schid
               244799.g0schid 244801.g0schid 244806.g0schid 244818.g0schid
               244831.g0schid 244839.g0schid 252885.g0schid 253888.g0schid
               257899.g0schid 257905.g0schid 259915.g0schid 261927.g0schid
               262937.g0schid 264945.g0schid 2.fyclasstype 3.fyclasstype


Instrumental variables (2SLS) regression          Number of obs   =      6,452
                                                  Wald chi2(83)   =   17029.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2987
                                                  Root MSE        =     22.501

                               (Std. Err. adjusted for 336 clusters in g1tchid)
-------------------------------------------------------------------------------
              |               Robust
        g1SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  g1classsize |  -.8582694    .155498    -5.52   0.000     -1.16304   -.5534989
   WhiteAsian |   7.085945   1.181219     6.00   0.000     4.770799    9.401091
         girl |   3.842944   .5578722     6.89   0.000     2.749535    4.936354
g1freelunch_2 |  -13.57291   .8666099   -15.66   0.000    -15.27143   -11.87438
WhiteTeacher1 |  -4.406009   1.960276    -2.25   0.025     -8.24808    -.563939
 MaleTeacher1 |    11.2891   2.846327     3.97   0.000     5.710406     16.8678
     g1tyears |   .0699406   .0593723     1.18   0.239     -.046427    .1863081
         g1md |   .5124853    1.06858     0.48   0.632    -1.581892    2.606863
              |
      g1schid |
      123056  |   7.991009   4.227408     1.89   0.059    -.2945588    16.27658
      128076  |  -2.839367   4.552264    -0.62   0.533    -11.76164    6.082906
      128079  |   6.133981   1.728428     3.55   0.000     2.746324    9.521638
      130085  |   23.50076   4.212569     5.58   0.000     15.24427    31.75724
      159171  |   18.67566     2.0968     8.91   0.000     14.56601    22.78531
      161176  |   10.88299   2.224601     4.89   0.000     6.522856    15.24313
      161183  |   27.40536   3.753198     7.30   0.000     20.04923    34.76149
      162184  |   16.85633   3.231519     5.22   0.000     10.52267       23.19
      164198  |   9.713312   1.405625     6.91   0.000     6.958337    12.46829
      165199  |   27.68095   3.007948     9.20   0.000     21.78548    33.57642
      166203  |  -1.464279   4.176219    -0.35   0.726    -9.649518    6.720961
      168211  |   22.13258   1.390802    15.91   0.000     19.40666    24.85851
      168214  |   29.23838   2.032468    14.39   0.000     25.25481    33.22194
      169219  |   15.30346   3.939109     3.89   0.000     7.582949    23.02397
      169229  |   13.66014   3.624229     3.77   0.000     6.556777    20.76349
      169231  |   7.375698   4.185056     1.76   0.078    -.8268621    15.57826
      169280  |   18.10279   5.325405     3.40   0.001     7.665191     28.5404
      170295  |   30.16708   4.205088     7.17   0.000     21.92526     38.4089
      173312  |     18.748   4.891413     3.83   0.000     9.161006    28.33499
      176329  |   21.67829   6.013187     3.61   0.000     9.892657    33.46392
      180344  |   17.53963   2.776337     6.32   0.000     12.09811    22.98115
      189378  |    11.0086   4.232371     2.60   0.009     2.713305     19.3039
      189382  |   17.08866   1.614367    10.59   0.000     13.92456    20.25276
      189396  |   9.984064   3.308257     3.02   0.003          3.5    16.46813
      191411  |  -2.827026   2.029894    -1.39   0.164    -6.805545    1.151493
      193422  |   10.46822   1.501355     6.97   0.000     7.525617    13.41082
      193423  |   6.267725   2.949154     2.13   0.034     .4874887    12.04796
      201449  |   25.20654   3.642662     6.92   0.000     18.06706    32.34603
      203452  |   19.64493   5.319692     3.69   0.000     9.218523    30.07133
      203457  |   24.60753   2.780316     8.85   0.000     19.15821    30.05685
      205488  |   1.952189   3.873339     0.50   0.614    -5.639416    9.543793
      205490  |   25.85616   10.04151     2.57   0.010      6.17517    45.53715
      205491  |   14.84711    4.55685     3.26   0.001     5.915846    23.77837
      205492  |    7.09927   3.093295     2.30   0.022     1.036524    13.16202
      208501  |   8.524249   3.958206     2.15   0.031     .7663075    16.28219
      208503  |   3.596605   5.309947     0.68   0.498    -6.810698    14.00391
      209510  |   10.99155   2.067545     5.32   0.000     6.939232    15.04386
      212522  |   6.802174    4.77787     1.42   0.155     -2.56228    16.16663
      215533  |   20.83781    6.62726     3.14   0.002      7.84862      33.827
      216537  |   17.52722    3.35656     5.22   0.000     10.94848    24.10595
      218562  |   21.32398   2.501785     8.52   0.000     16.42057    26.22739
      221571  |  -4.189854   3.845114    -1.09   0.276    -11.72614    3.346431
      221574  |   3.153646    3.55725     0.89   0.375    -3.818435    10.12573
      225585  |   3.174045   1.935686     1.64   0.101     -.619829     6.96792
      228606  |   28.68641   1.843884    15.56   0.000     25.07246    32.30035
      230612  |   19.03056   3.297398     5.77   0.000     12.56778    25.49334
      231616  |   18.38096   6.288032     2.92   0.003      6.05664    30.70527
      234628  |   25.10338   4.539774     5.53   0.000     16.20559    34.00118
      244697  |      7.138   3.242863     2.20   0.028     .7821056    13.49389
      244708  |   3.712621   3.867841     0.96   0.337    -3.868208    11.29345
      244723  |   3.270971   3.375891     0.97   0.333    -3.345655    9.887597
      244727  |   19.73088   2.782656     7.09   0.000     14.27697    25.18478
      244728  |  -3.157057   5.640215    -0.56   0.576    -14.21168    7.897561
      244736  |   .3005166   3.522784     0.09   0.932    -6.604013    7.205046
      244745  |   4.541766   2.624553     1.73   0.084    -.6022636    9.685796
      244746  |   18.61475   3.389277     5.49   0.000     11.97189    25.25761
      244755  |   2.703944   2.914981     0.93   0.354    -3.009313    8.417201
      244764  |   10.77686   6.534047     1.65   0.099    -2.029633    23.58336
      244774  |  -4.868668   4.719292    -1.03   0.302    -14.11831    4.380974
      244776  |  -2.061101   4.866191    -0.42   0.672    -11.59866    7.476458
      244780  |  -7.694299    4.05757    -1.90   0.058    -15.64699    .2583929
      244796  |   8.292478   2.513296     3.30   0.001     3.366508    13.21845
      244799  |   11.77734   3.256186     3.62   0.000     5.395332    18.15935
      244801  |  -3.381489   1.511659    -2.24   0.025    -6.344286   -.4186929
      244806  |   9.697734   3.665101     2.65   0.008     2.514268     16.8812
      244831  |  -1.170693    2.13528    -0.55   0.584    -5.355765     3.01438
      244839  |   20.59822   4.054199     5.08   0.000     12.65214    28.54431
      252885  |   15.00823   1.610696     9.32   0.000     11.85133    18.16514
      253888  |   9.066259   2.935523     3.09   0.002     3.312739    14.81978
      257899  |   6.663628   2.873858     2.32   0.020     1.030971    12.29629
      257905  |   19.57737   2.846366     6.88   0.000     13.99859    25.15614
      259915  |   3.325104   4.706726     0.71   0.480    -5.899909    12.55012
      261927  |    10.5411    2.19105     4.81   0.000     6.246716    14.83548
      262937  |    27.0779   1.840682    14.71   0.000     23.47023    30.68557
      264945  |    21.3646   3.522868     6.06   0.000     14.45991     28.2693
              |
        _cons |   60.53401   3.996111    15.15   0.000     52.70178    68.36625
-------------------------------------------------------------------------------
Instrumented:  g1classsize
Instruments:   WhiteAsian girl g1freelunch_2 WhiteTeacher1 MaleTeacher1
               g1tyears g1md 123056.g1schid 128076.g1schid 128079.g1schid
               130085.g1schid 159171.g1schid 161176.g1schid 161183.g1schid
               162184.g1schid 164198.g1schid 165199.g1schid 166203.g1schid
               168211.g1schid 168214.g1schid 169219.g1schid 169229.g1schid
               169231.g1schid 169280.g1schid 170295.g1schid 173312.g1schid
               176329.g1schid 180344.g1schid 189378.g1schid 189382.g1schid
               189396.g1schid 191411.g1schid 193422.g1schid 193423.g1schid
               201449.g1schid 203452.g1schid 203457.g1schid 205488.g1schid
               205490.g1schid 205491.g1schid 205492.g1schid 208501.g1schid
               208503.g1schid 209510.g1schid 212522.g1schid 215533.g1schid
               216537.g1schid 218562.g1schid 221571.g1schid 221574.g1schid
               225585.g1schid 228606.g1schid 230612.g1schid 231616.g1schid
               234628.g1schid 244697.g1schid 244708.g1schid 244723.g1schid
               244727.g1schid 244728.g1schid 244736.g1schid 244745.g1schid
               244746.g1schid 244755.g1schid 244764.g1schid 244774.g1schid
               244776.g1schid 244780.g1schid 244796.g1schid 244799.g1schid
               244801.g1schid 244806.g1schid 244831.g1schid 244839.g1schid
               252885.g1schid 253888.g1schid 257899.g1schid 257905.g1schid
               259915.g1schid 261927.g1schid 262937.g1schid 264945.g1schid
               2.fyclasstype 3.fyclasstype

note: 161176.g2schid identifies no observations in the sample
note: 168211.g2schid identifies no observations in the sample
note: 212522.g2schid identifies no observations in the sample

Instrumental variables (2SLS) regression          Number of obs   =      5,953
                                                  Wald chi2(79)   =    4786.64
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2777
                                                  Root MSE        =     22.435

                               (Std. Err. adjusted for 320 clusters in g2tchid)
-------------------------------------------------------------------------------
              |               Robust
        g2SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  g2classsize |  -.6699645   .1421399    -4.71   0.000    -.9485536   -.3913754
   WhiteAsian |   6.508062    1.17733     5.53   0.000     4.200539    8.815586
         girl |   3.426123   .5949918     5.76   0.000     2.259961    4.592286
g2freelunch_2 |  -13.59673   .7159544   -18.99   0.000    -14.99998   -12.19349
WhiteTeacher2 |   .4219681    1.73723     0.24   0.808    -2.982941    3.826877
 MaleTeacher2 |     2.4752   4.366921     0.57   0.571    -6.083808    11.03421
     g2tyears |   .0880638   .0650161     1.35   0.176    -.0393653    .2154929
         g2md |  -.8295281   1.055102    -0.79   0.432     -2.89749    1.238434
              |
      g2schid |
      123056  |   .1886473   4.922073     0.04   0.969    -9.458439    9.835734
      128076  |   6.668386   5.062316     1.32   0.188    -3.253571    16.59034
      128079  |  -3.734916    4.22679    -0.88   0.377    -12.01927    4.549442
      130085  |   17.55507   1.339039    13.11   0.000      14.9306    20.17954
      159171  |   6.752296   2.233709     3.02   0.003     2.374308    11.13028
      161176  |          0  (empty)
      161183  |   23.38454   3.330585     7.02   0.000     16.85671    29.91237
      162184  |   17.90063   5.954609     3.01   0.003     6.229813    29.57145
      164198  |   2.857411   1.986279     1.44   0.150    -1.035625    6.750447
      165199  |   16.05351   2.023113     7.94   0.000     12.08829    20.01874
      166203  |   9.079902   5.691287     1.60   0.111    -2.074816    20.23462
      168211  |          0  (empty)
      168214  |    14.8557   2.071243     7.17   0.000     10.79614    18.91526
      169219  |  -.6149289   6.214196    -0.10   0.921    -12.79453    11.56467
      169229  |   5.437798   2.512343     2.16   0.030     .5136965     10.3619
      169231  |  -2.899104   5.324988    -0.54   0.586    -13.33589     7.53768
      169280  |   10.03867   2.658439     3.78   0.000     4.828224    15.24911
      170295  |   14.13117   3.957414     3.57   0.000     6.374778    21.88756
      173312  |   20.38609   2.053363     9.93   0.000     16.36157     24.4106
      176329  |   3.626353   3.705399     0.98   0.328    -3.636095     10.8888
      189378  |   3.074468   2.677436     1.15   0.251    -2.173209    8.322146
      189382  |    1.02746   4.135253     0.25   0.804    -7.077486    9.132406
      189396  |   13.41546   3.074567     4.36   0.000     7.389425     19.4415
      191411  |   15.74451   4.753885     3.31   0.001     6.427064    25.06195
      193422  |   1.983641   5.296359     0.37   0.708    -8.397032    12.36431
      193423  |  -5.400804   4.374146    -1.23   0.217    -13.97397    3.172366
      201449  |   12.81249   2.824444     4.54   0.000     7.276684     18.3483
      203452  |   6.568256    2.91314     2.25   0.024     .8586066    12.27791
      203457  |   9.789274   3.893844     2.51   0.012     2.157479    17.42107
      205488  |  -3.670568   1.870221    -1.96   0.050    -7.336134    -.005001
      205490  |   5.261744   1.624483     3.24   0.001     2.077815    8.445672
      205491  |   5.981226   3.022008     1.98   0.048     .0581986    11.90425
      205492  |  -5.541657   8.044353    -0.69   0.491     -21.3083    10.22498
      208501  |   9.068956   3.080642     2.94   0.003     3.031008     15.1069
      208503  |   12.56286   2.989359     4.20   0.000      6.70382    18.42189
      209510  |   11.56172   2.623179     4.41   0.000      6.42038    16.70305
      212522  |          0  (empty)
      215533  |   2.363442   2.971234     0.80   0.426    -3.460069    8.186953
      216537  |   13.68832   2.123215     6.45   0.000      9.52689    17.84974
      218562  |   7.878963    4.16844     1.89   0.059    -.2910294    16.04896
      221571  |   2.463031   3.845524     0.64   0.522    -5.074057    10.00012
      221574  |  -5.532658   3.281846    -1.69   0.092    -11.96496    .8996425
      225585  |  -7.653766   2.709512    -2.82   0.005    -12.96431   -2.343221
      228606  |   19.34093   3.185288     6.07   0.000     13.09788    25.58398
      230612  |   .3522643    3.46042     0.10   0.919    -6.430034    7.134562
      231616  |   20.87133   4.997019     4.18   0.000     11.07735    30.66531
      234628  |   9.280842   6.103665     1.52   0.128    -2.682122    21.24381
      244697  |   3.688069   4.519327     0.82   0.414    -5.169649    12.54579
      244708  |  -.3123201   4.945078    -0.06   0.950    -10.00449    9.379855
      244723  |   -.027426   4.767371    -0.01   0.995    -9.371301    9.316449
      244727  |    .101347   5.303489     0.02   0.985     -10.2933    10.49599
      244728  |  -12.39893   2.377935    -5.21   0.000     -17.0596   -7.738264
      244736  |  -10.25407   2.836441    -3.62   0.000    -15.81339   -4.694745
      244745  |  -5.557346   3.416112    -1.63   0.104     -12.2528     1.13811
      244746  |    7.06132   5.760703     1.23   0.220     -4.22945    18.35209
      244755  |  -1.790329    3.41441    -0.52   0.600     -8.48245    4.901793
      244764  |   13.04754   3.108282     4.20   0.000     6.955424    19.13967
      244774  |  -11.55497   2.844528    -4.06   0.000    -17.13014   -5.979795
      244776  |   1.128008   4.511525     0.25   0.803    -7.714418    9.970434
      244780  |  -4.322562   4.125622    -1.05   0.295    -12.40863    3.763509
      244796  |  -.1447099   2.536469    -0.06   0.955    -5.116098    4.826678
      244799  |  -6.727683    4.10318    -1.64   0.101    -14.76977    1.314402
      244801  |  -5.855978   3.152449    -1.86   0.063    -12.03466    .3227085
      244806  |   8.930448   3.457979     2.58   0.010     2.152933    15.70796
      244831  |   3.762811   4.759124     0.79   0.429      -5.5649    13.09052
      244839  |   10.92871   5.089539     2.15   0.032     .9533968    20.90402
      252885  |   12.63111   2.474645     5.10   0.000     7.780898    17.48133
      253888  |     1.8044   2.841749     0.63   0.525    -3.765326    7.374126
      257899  |   8.993944   4.979791     1.81   0.071    -.7662657    18.75415
      257905  |   7.352484   4.150769     1.77   0.077    -.7828747    15.48784
      259915  |   -5.55579   5.993923    -0.93   0.354    -17.30366    6.192082
      261927  |   9.344637   1.816229     5.15   0.000     5.784894    12.90438
      262937  |    18.3392   1.475458    12.43   0.000     15.44735    21.23104
      264945  |   2.163127   3.155664     0.69   0.493     -4.02186    8.348114
              |
        _cons |    60.1039    4.29829    13.98   0.000     51.67941     68.5284
-------------------------------------------------------------------------------
Instrumented:  g2classsize
Instruments:   WhiteAsian girl g2freelunch_2 WhiteTeacher2 MaleTeacher2
               g2tyears g2md 123056.g2schid 128076.g2schid 128079.g2schid
               130085.g2schid 159171.g2schid 161183.g2schid 162184.g2schid
               164198.g2schid 165199.g2schid 166203.g2schid 168214.g2schid
               169219.g2schid 169229.g2schid 169231.g2schid 169280.g2schid
               170295.g2schid 173312.g2schid 176329.g2schid 189378.g2schid
               189382.g2schid 189396.g2schid 191411.g2schid 193422.g2schid
               193423.g2schid 201449.g2schid 203452.g2schid 203457.g2schid
               205488.g2schid 205490.g2schid 205491.g2schid 205492.g2schid
               208501.g2schid 208503.g2schid 209510.g2schid 215533.g2schid
               216537.g2schid 218562.g2schid 221571.g2schid 221574.g2schid
               225585.g2schid 228606.g2schid 230612.g2schid 231616.g2schid
               234628.g2schid 244697.g2schid 244708.g2schid 244723.g2schid
               244727.g2schid 244728.g2schid 244736.g2schid 244745.g2schid
               244746.g2schid 244755.g2schid 244764.g2schid 244774.g2schid
               244776.g2schid 244780.g2schid 244796.g2schid 244799.g2schid
               244801.g2schid 244806.g2schid 244831.g2schid 244839.g2schid
               252885.g2schid 253888.g2schid 257899.g2schid 257905.g2schid
               259915.g2schid 261927.g2schid 262937.g2schid 264945.g2schid
               2.fyclasstype 3.fyclasstype

note: 230612.g3schid identifies no observations in the sample

Instrumental variables (2SLS) regression          Number of obs   =      6,100
                                                  Wald chi2(81)   =    2909.94
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2198
                                                  Root MSE        =     23.836

                               (Std. Err. adjusted for 323 clusters in g3tchid)
-------------------------------------------------------------------------------
              |               Robust
        g3SAT |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  g3classsize |  -.7941011   .1465751    -5.42   0.000    -1.081383   -.5068192
   WhiteAsian |   6.071218   1.441164     4.21   0.000      3.24659    8.895847
         girl |   4.190411   .6500043     6.45   0.000     2.916426    5.464396
g3freelunch_2 |  -12.86033   .8104706   -15.87   0.000    -14.44883   -11.27184
WhiteTeacher3 |   .5783257   1.754108     0.33   0.742    -2.859662    4.016314
 MaleTeacher3 |   -7.09166   2.901764    -2.44   0.015    -12.77901   -1.404306
     g3tyears |   .0389692   .0648533     0.60   0.548    -.0881409    .1660793
         g3md |   1.285921    1.16408     1.10   0.269    -.9956327    3.567475
              |
      g3schid |
      123056  |   5.442476   6.247793     0.87   0.384    -6.802973    17.68792
      128076  |  -2.837894   5.029893    -0.56   0.573     -12.6963    7.020515
      128079  |   -10.8454   4.843759    -2.24   0.025    -20.33899   -1.351808
      130085  |   12.62193   5.781668     2.18   0.029     1.290071    23.95379
      159171  |   1.560134   5.664829     0.28   0.783    -9.542726    12.66299
      161176  |   1.537322   4.975121     0.31   0.757    -8.213736    11.28838
      161183  |   3.951576   5.526531     0.72   0.475    -6.880226    14.78338
      162184  |   .4066613   6.101745     0.07   0.947    -11.55254    12.36586
      164198  |  -6.939163    4.80771    -1.44   0.149     -16.3621    2.483776
      165199  |   7.890097   6.337952     1.24   0.213    -4.532061    20.31226
      166203  |   2.283551   7.985767     0.29   0.775    -13.36826    17.93537
      168211  |   4.871655   4.754068     1.02   0.305    -4.446146    14.18946
      168214  |   11.49715   4.999623     2.30   0.021     1.698065    21.29623
      169219  |   5.257283   5.907565     0.89   0.374    -6.321332     16.8359
      169229  |   1.161566   5.019177     0.23   0.817    -8.675841    10.99897
      169231  |  -7.405848   5.025652    -1.47   0.141    -17.25595    2.444249
      169280  |  -1.547846   5.185391    -0.30   0.765    -11.71103    8.615334
      170295  |   4.035258   6.511997     0.62   0.535    -8.728022    16.79854
      173312  |   6.935924   4.479911     1.55   0.122    -1.844541    15.71639
      176329  |  -2.830657   4.471802    -0.63   0.527    -11.59523    5.933913
      189378  |   5.289887   4.875359     1.09   0.278     -4.26564    14.84542
      189382  |   3.202157   5.973687     0.54   0.592    -8.506053    14.91037
      189396  |    -3.0452   5.442564    -0.56   0.576    -13.71243     7.62203
      191411  |  -3.737541   7.175441    -0.52   0.602    -17.80115    10.32606
      193422  |  -2.619033   6.122973    -0.43   0.669    -14.61984    9.381773
      193423  |  -4.893794   6.241032    -0.78   0.433    -17.12599    7.338405
      201449  |   3.141928   4.391893     0.72   0.474    -5.466023    11.74988
      203452  |  -.4435663   4.413258    -0.10   0.920    -9.093392     8.20626
      203457  |   11.86442   5.911403     2.01   0.045     .2782881    23.45056
      205488  |   3.436226   4.589396     0.75   0.454    -5.558824    12.43128
      205490  |   7.043138   7.275493     0.97   0.333    -7.216567    21.30284
      205491  |   7.616569   4.822266     1.58   0.114    -1.834899    17.06804
      205492  |  -18.92228   5.053231    -3.74   0.000    -28.82643   -9.018126
      208501  |   14.79944   4.423817     3.35   0.001     6.128915    23.46996
      208503  |   8.507274   6.040559     1.41   0.159    -3.332003    20.34655
      209510  |   14.47313   5.040561     2.87   0.004     4.593811    24.35245
      212522  |  -7.545515   5.916558    -1.28   0.202    -19.14176    4.050726
      215533  |   .5099695   5.516639     0.09   0.926    -10.30244    11.32238
      216537  |   .8316071   5.279618     0.16   0.875    -9.516253    11.17947
      218562  |   4.162589   6.049314     0.69   0.491    -7.693849    16.01903
      221571  |  -.8082987   5.041228    -0.16   0.873    -10.68893    9.072328
      221574  |  -3.090735   5.830067    -0.53   0.596    -14.51746    8.335987
      225585  |  -9.946174    4.29942    -2.31   0.021    -18.37288   -1.519465
      228606  |   13.98934   5.002164     2.80   0.005     4.185279     23.7934
      230612  |          0  (empty)
      231616  |   20.63864    6.70656     3.08   0.002     7.494021    33.78325
      234628  |  -.5305224    4.50689    -0.12   0.906    -9.363864    8.302819
      244697  |  -2.685569   6.902422    -0.39   0.697    -16.21407    10.84293
      244708  |  -11.25037   5.402022    -2.08   0.037    -21.83814   -.6626071
      244723  |   .6759687   7.507469     0.09   0.928     -14.0384    15.39034
      244727  |   2.778982   5.413416     0.51   0.608    -7.831118    13.38908
      244728  |  -11.36192   4.392338    -2.59   0.010    -19.97074   -2.753096
      244736  |  -9.329344    6.68102    -1.40   0.163     -22.4239    3.765214
      244745  |  -11.83386   5.306393    -2.23   0.026     -22.2342   -1.433519
      244746  |   5.464109   7.571448     0.72   0.470    -9.375656    20.30387
      244755  |  -6.120396     6.3607    -0.96   0.336    -18.58714    6.346346
      244764  |   4.711983   4.553255     1.03   0.301    -4.212232     13.6362
      244774  |  -10.96965    5.76721    -1.90   0.057    -22.27317    .3338784
      244776  |   5.171101   10.09373     0.51   0.608    -14.61225    24.95445
      244780  |   1.238704   6.776026     0.18   0.855    -12.04206    14.51947
      244796  |  -6.144861   4.957515    -1.24   0.215    -15.86141    3.571689
      244799  |   8.514992   6.926648     1.23   0.219    -5.060988    22.09097
      244801  |  -.5783726     8.8122    -0.07   0.948    -17.84997    16.69322
      244806  |  -4.248817   5.065782    -0.84   0.402    -14.17757    5.679933
      244831  |  -.9661344   5.777408    -0.17   0.867    -12.28965    10.35738
      244839  |   3.609543   6.525522     0.55   0.580    -9.180245    16.39933
      252885  |  -10.32172   6.493452    -1.59   0.112    -23.04865    2.405211
      253888  |    .446254   5.172015     0.09   0.931     -9.69071    10.58322
      257899  |   5.772716   5.500615     1.05   0.294    -5.008292    16.55372
      257905  |   3.137612   4.705653     0.67   0.505    -6.085298    12.36052
      259915  |  -3.117089     4.6323    -0.67   0.501    -12.19623    5.962052
      261927  |   .5340179   4.470333     0.12   0.905    -8.227673    9.295709
      262937  |   13.38169   5.031314     2.66   0.008     3.520492    23.24288
      264945  |  -1.047744   4.580231    -0.23   0.819    -10.02483    7.929343
              |
        _cons |   66.42688   5.942172    11.18   0.000     54.78044    78.07332
-------------------------------------------------------------------------------
Instrumented:  g3classsize
Instruments:   WhiteAsian girl g3freelunch_2 WhiteTeacher3 MaleTeacher3
               g3tyears g3md 123056.g3schid 128076.g3schid 128079.g3schid
               130085.g3schid 159171.g3schid 161176.g3schid 161183.g3schid
               162184.g3schid 164198.g3schid 165199.g3schid 166203.g3schid
               168211.g3schid 168214.g3schid 169219.g3schid 169229.g3schid
               169231.g3schid 169280.g3schid 170295.g3schid 173312.g3schid
               176329.g3schid 189378.g3schid 189382.g3schid 189396.g3schid
               191411.g3schid 193422.g3schid 193423.g3schid 201449.g3schid
               203452.g3schid 203457.g3schid 205488.g3schid 205490.g3schid
               205491.g3schid 205492.g3schid 208501.g3schid 208503.g3schid
               209510.g3schid 212522.g3schid 215533.g3schid 216537.g3schid
               218562.g3schid 221571.g3schid 221574.g3schid 225585.g3schid
               228606.g3schid 231616.g3schid 234628.g3schid 244697.g3schid
               244708.g3schid 244723.g3schid 244727.g3schid 244728.g3schid
               244736.g3schid 244745.g3schid 244746.g3schid 244755.g3schid
               244764.g3schid 244774.g3schid 244776.g3schid 244780.g3schid
               244796.g3schid 244799.g3schid 244801.g3schid 244806.g3schid
               244831.g3schid 244839.g3schid 252885.g3schid 253888.g3schid
               257899.g3schid 257905.g3schid 259915.g3schid 261927.g3schid
               262937.g3schid 264945.g3schid 2.fyclasstype 3.fyclasstype


. 
. * Output table 7 to latex. Have one table per grade. 
. forvalues i == 0/3 {
  2.         est2tex table7`i', replace preserve path("./Output/Table 7") mark(stars) levels(90 95 99) flexible(2) f
> ancy label leadzero thousep collabels("(1)" "(2)" "(3)" "(4)")
  3. } 
matrix ./Output/Table 7/table70_tbl.dta saved
TeX file ./Output/Table 7/table70.tex saved
matrix ./Output/Table 7/table71_tbl.dta saved
TeX file ./Output/Table 7/table71.tex saved
matrix ./Output/Table 7/table72_tbl.dta saved
TeX file ./Output/Table 7/table72.tex saved
matrix ./Output/Table 7/table73_tbl.dta saved
TeX file ./Output/Table 7/table73.tex saved

. 
. 
end of do-file

