--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\maris\Dropbox\Grad\582 - Metrics I\ECON-582---Krueger-Replication\Analysis/Log-
> TablesAndFigures.txt
  log type:  text
 opened on:  18 Nov 2019, 15:12:05

. 
. use "./Raw Data/STAR_Students.dta"

. 
. 
. * Create variables to tell when a student entered STAR.
. gen gradeenter = 0 if flagsgk == 1
(5,276 missing values generated)

. replace gradeenter = 1 if flagsgk == 0 & flagsg1 == 1
(2,314 real changes made)

. replace gradeenter = 2 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 1 
(1,679 real changes made)

. replace gradeenter = 3 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 0 & flagsg3 == 1 
(1,283 real changes made)

. 
. 
. * Drop if race is missing and create White/Asian indicator
. drop if race == .
(134 observations deleted)

. gen WhiteAsian = 1 if race == 1 | race == 3
(4,235 missing values generated)

. replace WhiteAsian = 0 if WhiteAsian == . & race != .
(4,235 real changes made)

. 
. 
. * Create variable: Age as of September 1st, 1985 (start of 1985 school year)
. gen bday = mdy(birthmonth, birthday, birthyear)
(37 missing values generated)

. gen startschool = mdy(9,1,1985)

. gen age = (startschool - bday)/365
(37 missing values generated)

. 
. 
. * Redefine free lunch as (0 1) instead of (1 2)
. local freelunch = "gkfreelunch g1freelunch g2freelunch g3freelunch"

. 
. foreach var of local freelunch {
  2.  gen `var'_2 = .  if `var'== .  
  3.  replace `var'_2 = 0 if `var' == 2
  4.  replace `var'_2 = 1 if `var' == 1
  5. }
(11,467 missing values generated)
(3,248 real changes made)
(3,051 real changes made)
(11,467 missing values generated)
(3,214 real changes made)
(3,408 real changes made)
(11,467 missing values generated)
(3,140 real changes made)
(3,278 real changes made)
(11,467 missing values generated)
(3,221 real changes made)
(3,285 real changes made)

. 
. 
. * Redefine gender as (0 -male,1 -female) instead of (1,2) 
. gen girl = gender - 1

. 
. 
. * Create variable: Attrition rate: percent that exits sample before completing third grade 
. * Kindergarten:
. gen g0attrition = 1 if flagsgk == 1 & flagsg1 == 0 | flagsg2 == 0 | flagsg3 == 0 
(5,338 missing values generated)

. replace g0attrition = 0 if g0attrition == .
(5,338 real changes made)

. 
. * 1st Grade:
. gen g1attrition = 1 if flagsg1 == 1 & flagsgk == 0 & flagsg2 == 0 | flagsg3 == 0 
(6,756 missing values generated)

. replace g1attrition = 0 if g1attrition == .
(6,756 real changes made)

. 
. * 2nd Grade:
. gen g2attrition = 1 if flagsg2 == 1 & flagsg3 == 0 
(10,128 missing values generated)

. replace g2attrition = 0 if g2attrition == .
(10,128 real changes made)

. 
. * 3rd Grade: Attrition not available
. gen g3attrition = 0

. 
. 
. * Create indicator for white teacher in each grade
. rename gktrace g0trace

. 
. forvalues i == 0/3 {
  2.         gen g`i'twhite = 1 if g`i'trace == 1
  3.         replace g`i'twhite = 0 if g`i'twhite==. & g`i'trace != .
  4. }
(6,223 missing values generated)
(1,035 real changes made)
(5,866 missing values generated)
(1,182 real changes made)
(6,140 missing values generated)
(1,365 real changes made)
(6,151 missing values generated)
(1,421 real changes made)

. 
. * Create indicator for teacher with master's degree or higher in each grade
. rename gkthighdegree g0thighdegree

. 
. forvalues i == 0/3 {
  2.         gen g`i'md = 1 if g`i'thighdegree == 3 | g`i'thighdegree == 4 | g`i'thighdegree == 5 | g`i'thighd
> egree == 6
  3.         replace g`i'md = 0 if g`i'md==. & g`i'thighdegree != .
  4. }
(9,282 missing values generated)
(4,116 real changes made)
(9,124 missing values generated)
(4,440 real changes made)
(8,970 missing values generated)
(4,195 real changes made)
(8,502 missing values generated)
(3,757 real changes made)

. 
. tab g1md, m

       g1md |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,440       38.72       38.72
          1 |      2,343       20.43       59.15
          . |      4,684       40.85      100.00
------------+-----------------------------------
      Total |     11,467      100.00

.  tab g1thighdegree,m

    TEACHER |
    HIGHEST |
     DEGREE |
    GRADE 1 |      Freq.     Percent        Cum.
------------+-----------------------------------
  bachelors |      4,440       38.72       38.72
    masters |      2,283       19.91       58.63
 specialist |         38        0.33       58.96
   doctoral |         22        0.19       59.15
          . |      4,684       40.85      100.00
------------+-----------------------------------
      Total |     11,467      100.00

. 
end of do-file

