------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\maris\Dropbox\Grad\582 - Metrics I\ECON-582---K
> rueger-Replication\Analysis/Log-TablesAndFigures.txt
  log type:  text
 opened on:  21 Nov 2019, 18:03:25

. 
. use "./Raw Data/STAR_Students.dta"

. 
. * Rename gk variables as g0 to make loops possible later on
. rename gkclasstype g0classtype

. rename gkclasssize g0classsize

. rename gktmathss g0tmathss

. rename gkwordskillss g0wordskillss

. rename gktreadss g0treadss

. rename gktrace g0trace

. rename gkthighdegree g0thighdegree

. rename gkschid g0schid

. rename gktchid g0tchid

. rename gktyears g0tyears

. rename gktgen g0tgen

. 
. 
. 
. * Create variables to tell when a student entered STAR.
. gen gradeenter = 0 if flagsgk == 1
(5,276 missing values generated)

. replace gradeenter = 1 if flagsgk == 0 & flagsg1 == 1
(2,314 real changes made)

. replace gradeenter = 2 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 1 
(1,679 real changes made)

. replace gradeenter = 3 if flagsgk == 0 & flagsg1 == 0 & flagsg2 == 0 & flags
> g3 == 1 
(1,283 real changes made)

. 
. 
. * Create White/Asian indicator
. gen WhiteAsian = 1 if race == 1 | race == 3
(4,369 missing values generated)

. replace WhiteAsian = 0 if WhiteAsian == . & race != .
(4,235 real changes made)

. 
. 
. * Create variable: Age as of September 1st, 1985 (start of 1985 school year)
. gen bday = mdy(birthmonth, birthday, birthyear)
(71 missing values generated)

. gen startschool = mdy(9,1,1985)

. gen age = (startschool - bday)/365
(71 missing values generated)

. 
. 
. * Redefine free lunch as (0 1) instead of (1 2)
. local freelunch = "gkfreelunch g1freelunch g2freelunch g3freelunch"

. 
. foreach var of local freelunch {
  2.  gen `var'_2 = .  if `var'== .  
  3.  replace `var'_2 = 0 if `var' == 2
  4.  replace `var'_2 = 1 if `var' == 1
  5. }
(11,601 missing values generated)
(3,248 real changes made)
(3,052 real changes made)
(11,601 missing values generated)
(3,221 real changes made)
(3,429 real changes made)
(11,601 missing values generated)
(3,160 real changes made)
(3,336 real changes made)
(11,601 missing values generated)
(3,227 real changes made)
(3,293 real changes made)

. rename gkfreelunch_2 g0freelunch_2

. 
. 
. * Redefine gender as (0-male,1-female) instead of (1,2) 
. gen girl = gender - 1
(20 missing values generated)

. 
. 
. * Create variable: Attrition rate: percent that exits sample before completi
> ng third grade 
. * Kindergarten:
. gen g0attrition = 1 if flagsgk == 1 & flagsg1 == 0 | flagsg2 == 0 | flagsg3 
> == 0 
(5,339 missing values generated)

. replace g0attrition = 0 if g0attrition == .
(5,339 real changes made)

. * 1st Grade:
. gen g1attrition = 1 if flagsg1 == 1 & flagsg2 == 0 | flagsg3 == 0 
(6,725 missing values generated)

. replace g1attrition = 0 if g1attrition == .
(6,725 real changes made)

. * 2nd Grade:
. gen g2attrition = 1 if flagsg2 == 1 & flagsg3 == 0 
(10,174 missing values generated)

. replace g2attrition = 0 if g2attrition == .
(10,174 real changes made)

. * 3rd Grade: Attrition not available
. gen g3attrition = 0

. 
. 
. * Create indicator for white teacher in each grade
. forvalues i == 0/3 {
  2.         gen g`i'twhite = 1 if g`i'trace == 1
  3.         replace g`i'twhite = 0 if g`i'twhite==. & g`i'trace != .
  4. }
(6,355 missing values generated)
(1,036 real changes made)
(5,978 missing values generated)
(1,187 real changes made)
(6,203 missing values generated)
(1,382 real changes made)
(6,273 missing values generated)
(1,423 real changes made)

. 
. 
. * Create indicator for teacher with master's degree or higher in each grade
. forvalues i == 0/3 {
  2.         gen g`i'md = 1 if g`i'thighdegree == 3 | g`i'thighdegree == 4 | g
> `i'thighdegree == 5 | g`i'thighdegree == 6
  3.         replace g`i'md = 0 if g`i'md==. & g`i'thighdegree != .
  4. }
(9,416 missing values generated)
(4,119 real changes made)
(9,247 missing values generated)
(4,456 real changes made)
(9,071 missing values generated)
(4,250 real changes made)
(8,627 missing values generated)
(3,762 real changes made)

. 
. 
. * Create White Teacher indicator
. forvalues i == 0/3 {
  2.         gen WhiteTeacher`i' = 1 if g`i'trace == 1
  3.         replace WhiteTeacher`i' = 0 if WhiteTeacher`i' == . & g`i'trace !
> = .
  4. }
(6,355 missing values generated)
(1,036 real changes made)
(5,978 missing values generated)
(1,187 real changes made)
(6,203 missing values generated)
(1,382 real changes made)
(6,273 missing values generated)
(1,423 real changes made)

. 
. 
. * Create Male Teacher indicator
. forvalues i == 0/3 {
  2.         gen MaleTeacher`i' = 1 if g`i'tgen == 1
  3.         replace MaleTeacher`i' = 0 if MaleTeacher`i' == . & g`i'tgen != .
  4. }
(11,601 missing values generated)
(6,325 real changes made)
(11,572 missing values generated)
(6,781 real changes made)
(11,530 missing values generated)
(6,709 real changes made)
(11,373 missing values generated)
(6,523 real changes made)

. 
. 
. * Create dummy for small class, regular class, and regular+aide (need for II
>  V and VII)
. forvalues i == 0/3{
  2.         gen g`i's = 1 if g`i'classtype==1
  3.         replace g`i's = 0 if g`i's == . & g`i'classtype != .
  4. 
.         gen g`i'r = 1 if g`i'classtype==2
  5.         replace g`i'r = 0 if g`i'r == . & g`i'classtype != .
  6. 
.         gen g`i'ra = 1 if g`i'classtype==3
  7.         replace g`i'ra = 0 if g`i'ra == . & g`i'classtype !=  .
  8. }
(9,701 missing values generated)
(4,425 real changes made)
(9,407 missing values generated)
(4,131 real changes made)
(9,370 missing values generated)
(4,094 real changes made)
(9,676 missing values generated)
(4,904 real changes made)
(9,017 missing values generated)
(4,245 real changes made)
(9,281 missing values generated)
(4,509 real changes made)
(9,585 missing values generated)
(4,824 real changes made)
(9,272 missing values generated)
(4,511 real changes made)
(9,106 missing values generated)
(4,345 real changes made)
(9,427 missing values generated)
(4,628 real changes made)
(9,516 missing values generated)
(4,717 real changes made)
(9,058 missing values generated)
(4,259 real changes made)

. 
. 
. 
. * Create variable: Percentile Score as SAT average for reading, math, and li
> stening
. forvalues i == 0/3 {
  2. 
.         foreach sub in `i'tread `i'tmath `i'wordskill {
  3.                 cumul g`sub'ss if inrange(g`i'classtype,2,3), gen(g`sub'x
> t)
  4.                 sort g`sub'ss
  5.                 replace g`sub'xt=g`sub'xt[_n-1] if g`sub'ss==g`sub'ss[_n-
> 1] & g`i'classtype==1
  6.                 ipolate g`sub'xt g`sub'ss, gen(ipo)
  7.                 replace g`sub'xt=ipo if g`i'classtype==1 & mi(g`sub'xt)
  8.                 drop ipo
  9.         }
 10.         egen g`i'SAT = rmean(g`i'treadxt g`i'tmathxt g`i'wordskillxt)
 11.         replace g`i'SAT=100*g`i'SAT
 12. }
(1,701 real changes made)
(5812 missing values generated)
(38 real changes made)
(1,748 real changes made)
(5731 missing values generated)
(13 real changes made)
(1,744 real changes made)
(5750 missing values generated)
(11 real changes made)
(5700 missing values generated)
(5,901 real changes made)
(1,801 real changes made)
(5206 missing values generated)
(22 real changes made)
(1,847 real changes made)
(5003 missing values generated)
(20 real changes made)
(1,649 real changes made)
(5629 missing values generated)
(19 real changes made)
(4966 missing values generated)
(6,635 real changes made)
(1,765 real changes made)
(5524 missing values generated)
(29 real changes made)
(1,747 real changes made)
(5536 missing values generated)
(42 real changes made)
(1,863 real changes made)
(5254 missing values generated)
(13 real changes made)
(5241 missing values generated)
(6,360 real changes made)
(1,874 real changes made)
(5601 missing values generated)
(41 real changes made)
(1,886 real changes made)
(5526 missing values generated)
(50 real changes made)
(2,046 real changes made)
(5252 missing values generated)
(19 real changes made)
(5246 missing values generated)
(6,355 real changes made)

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. 
. gen fyclasstype = .
(11,601 missing values generated)

. replace fyclasstype = g0classtype if gradeenter == 0
(6,325 real changes made)

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. drop fyclasstype

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. forvalues i == 0/3 {
  2. gen fyclasstype = .
  3. replace fyclasstype = g`i'classtype if gradeenter == `i'
  4. }
(11,601 missing values generated)
(6,325 real changes made)
variable fyclasstype already defined
r(110);

end of do-file

r(110);

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. drop fyclasstype

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. forvalues i == 0/3 {
  2. gen fyclasstype = .
  3. replace fyclasstype = g`i'classtype if gradeenter == `i'
  4. }
(11,601 missing values generated)
(6,325 real changes made)
variable fyclasstype already defined
r(110);

end of do-file

r(110);

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. 
. drop fyclasstype

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. gen fyclasstype = .
(11,601 missing values generated)

. forvalues i == 0/3 {
  2. 
. replace fyclasstype = g`i'classtype if gradeenter == `i'
  3. }
(6,325 real changes made)
(2,314 real changes made)
(1,679 real changes made)
(1,283 real changes made)

. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

.         * 5. Small Class, Regular/Aide class, no school FE
. forvalues i == 0/3 {
  2.         reg g`i'SAT i.fyclasstype, vce(cluster g`i'tchid) 
  3.         est2vec table5a`i', replace vars(g`i'SAT g`i's g`i'ra WhiteAsian girl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyea
> rs g`i'md) e(r2`i') name(Col1`i')
  4. } 

Linear regression                               Number of obs     =      5,901
                                                F(2, 324)         =       3.45
                                                Prob > F          =     0.0330
                                                R-squared         =     0.0067
                                                Root MSE          =     26.564

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          2  |  -4.784635   2.187794    -2.19   0.029    -9.088711   -.4805596
          3  |  -4.704066   2.055796    -2.29   0.023    -8.748459   -.6596734
             |
       _cons |   54.71236   1.429882    38.26   0.000     51.89934    57.52539
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,635
                                                F(2, 338)         =       9.59
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0130
                                                Root MSE          =     26.707

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          2  |   -7.65885   1.752971    -4.37   0.000    -11.10696   -4.210742
          3  |  -5.726605   1.727748    -3.31   0.001    -9.125099   -2.328111
             |
       _cons |   56.70437   1.374235    41.26   0.000     54.00124    59.40751
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,360
                                                F(2, 334)         =       6.30
                                                Prob > F          =     0.0021
                                                R-squared         =     0.0079
                                                Root MSE          =     26.389

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          2  |  -5.362967   1.658008    -3.23   0.001    -8.624421   -2.101514
          3  |  -5.453597   1.622602    -3.36   0.001    -8.645404    -2.26179
             |
       _cons |   55.28771   1.271223    43.49   0.000      52.7871    57.78833
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,354
                                                F(2, 333)         =      10.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0100
                                                Root MSE          =     26.906

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          2  |  -5.894011   1.443819    -4.08   0.000    -8.734167   -3.053854
          3  |  -6.282424   1.468786    -4.28   0.000    -9.171692   -3.393156
             |
       _cons |   55.71894   1.152047    48.37   0.000     53.45273    57.98515
------------------------------------------------------------------------------


. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. forvalues i == 0/3 {
  2.         reg g`i'SAT ib(2).fyclasstype, vce(cluster g`i'tchid) 
  3.         est2vec table5a`i', replace vars(g`i'SAT g`i's g`i'ra WhiteAsian girl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyea
> rs g`i'md) e(r2`i') name(Col1`i')
  4. } 

Linear regression                               Number of obs     =      5,901
                                                F(2, 324)         =       3.45
                                                Prob > F          =     0.0330
                                                R-squared         =     0.0067
                                                Root MSE          =     26.564

                              (Std. Err. adjusted for 325 clusters in g0tchid)
------------------------------------------------------------------------------
             |               Robust
       g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          1  |   4.784635   2.187794     2.19   0.029     .4805596    9.088711
          3  |   .0805689   2.218922     0.04   0.971    -4.284744    4.445882
             |
       _cons |   49.92773   1.655863    30.15   0.000     46.67013    53.18533
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,635
                                                F(2, 338)         =       9.59
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0130
                                                Root MSE          =     26.707

                              (Std. Err. adjusted for 339 clusters in g1tchid)
------------------------------------------------------------------------------
             |               Robust
       g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          1  |    7.65885   1.752971     4.37   0.000     4.210742    11.10696
          3  |   1.932245   1.104927     1.75   0.081    -.2411544    4.105644
             |
       _cons |   49.04552   1.143043    42.91   0.000     46.79715     51.2939
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,360
                                                F(2, 334)         =       6.30
                                                Prob > F          =     0.0021
                                                R-squared         =     0.0079
                                                Root MSE          =     26.389

                              (Std. Err. adjusted for 335 clusters in g2tchid)
------------------------------------------------------------------------------
             |               Robust
       g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          1  |   5.362967   1.658008     3.23   0.001     2.101514    8.624421
          3  |  -.0906295   1.204036    -0.08   0.940    -2.459078    2.277819
             |
       _cons |   49.92475   1.155631    43.20   0.000     47.65151    52.19798
------------------------------------------------------------------------------


Linear regression                               Number of obs     =      6,354
                                                F(2, 333)         =      10.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0100
                                                Root MSE          =     26.906

                              (Std. Err. adjusted for 334 clusters in g3tchid)
------------------------------------------------------------------------------
             |               Robust
       g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 fyclasstype |
          1  |   5.894011   1.443819     4.08   0.000     3.053854    8.734167
          3  |  -.3884136   1.153707    -0.34   0.737    -2.657885    1.881058
             |
       _cons |   49.82493   1.025886    48.57   0.000      47.8069    51.84296
------------------------------------------------------------------------------


. 
end of do-file

. do "C:\Users\mreuther\AppData\Local\Temp\13\STD1ba8_000000.tmp"

. forvalues i == 0/3 {
  2.         areg g`i'SAT ib(2).fyclasstype WhiteAsian girl g`i'freelunch_2 WhiteTeacher`i' MaleTeacher`i' g`i'tyears g`i'md, vce(cluster 
> g`i'tchid) absorb(g`i'schid)
  3.         est2vec table5a`i', addto(table5a`i') name(Col4`i')
  4. }       
note: MaleTeacher0 omitted because of collinearity

Linear regression, absorbing indicators         Number of obs     =      5,839
Absorbed variable: g0schid                      No. of categories =         79
                                                F(   8,    322)   =      54.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3088
                                                Adj R-squared     =     0.2985
                                                Root MSE          =    22.3480

                               (Std. Err. adjusted for 323 clusters in g0tchid)
-------------------------------------------------------------------------------
              |               Robust
        g0SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  fyclasstype |
           1  |   5.334463   1.196487     4.46   0.000     2.980544    7.688382
           3  |   .2777409   1.067201     0.26   0.795    -1.821826    2.377307
              |
   WhiteAsian |   8.399696   1.363424     6.16   0.000     5.717351    11.08204
         girl |   4.370097   .6287982     6.95   0.000     3.133025    5.607168
g0freelunch_2 |  -13.09236   .7747857   -16.90   0.000    -14.61664   -11.56808
WhiteTeacher0 |  -1.114408   2.159911    -0.52   0.606    -5.363728    3.134911
 MaleTeacher0 |          0  (omitted)
     g0tyears |   .2645703   .1054319     2.51   0.013      .057148    .4719926
         g0md |  -.5778924   1.059654    -0.55   0.586    -2.662612    1.506827
        _cons |   46.97919   2.471494    19.01   0.000     42.11688    51.84151
-------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,452
Absorbed variable: g1schid                      No. of categories =         76
                                                F(   9,    335)   =      50.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2971
                                                Adj R-squared     =     0.2878
                                                Root MSE          =    22.6693

                               (Std. Err. adjusted for 336 clusters in g1tchid)
-------------------------------------------------------------------------------
              |               Robust
        g1SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  fyclasstype |
           1  |   6.373275   1.107533     5.75   0.000     4.194679    8.551871
           3  |    1.51062    .756707     2.00   0.047     .0221241    2.999116
              |
   WhiteAsian |   6.801396   1.189731     5.72   0.000      4.46111    9.141681
         girl |   3.805089    .560384     6.79   0.000     2.702774    4.907403
g1freelunch_2 |  -13.76318   .8705814   -15.81   0.000    -15.47568   -12.05069
WhiteTeacher1 |  -4.401391   1.965014    -2.24   0.026    -8.266712   -.5360695
 MaleTeacher1 |   12.76647    3.42728     3.72   0.000     6.024764    19.50817
     g1tyears |   .0601101   .0599156     1.00   0.316    -.0577482    .1779683
         g1md |   .5853557   1.088897     0.54   0.591    -1.556581    2.727292
        _cons |   52.88079   2.335837    22.64   0.000     48.28603    57.47554
-------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      5,953
Absorbed variable: g2schid                      No. of categories =         72
                                                F(   9,    319)   =      52.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2765
                                                Adj R-squared     =     0.2666
                                                Root MSE          =    22.6093

                               (Std. Err. adjusted for 320 clusters in g2tchid)
-------------------------------------------------------------------------------
              |               Robust
        g2SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  fyclasstype |
           1  |   5.265715   1.102205     4.78   0.000     3.097206    7.434224
           3  |   1.162508   .8037914     1.45   0.149     -.418894     2.74391
              |
   WhiteAsian |   6.352422   1.200868     5.29   0.000     3.989799    8.715044
         girl |   3.428715   .6021328     5.69   0.000     2.244062    4.613368
g2freelunch_2 |  -13.71979   .7304093   -18.78   0.000    -15.15682   -12.28276
WhiteTeacher2 |    .443788   1.768073     0.25   0.802    -3.034769    3.922345
 MaleTeacher2 |    .833023   4.194495     0.20   0.843    -7.419346    9.085392
     g2tyears |   .1004489   .0659342     1.52   0.129    -.0292719    .2301697
         g2md |  -1.188905   1.055608    -1.13   0.261    -3.265737    .8879277
        _cons |   49.55614   2.194612    22.58   0.000     45.23839    53.87388
-------------------------------------------------------------------------------


Linear regression, absorbing indicators         Number of obs     =      6,100
Absorbed variable: g3schid                      No. of categories =         74
                                                F(   9,    322)   =      43.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2210
                                                Adj R-squared     =     0.2104
                                                Root MSE          =    23.9786

                               (Std. Err. adjusted for 323 clusters in g3tchid)
-------------------------------------------------------------------------------
              |               Robust
        g3SAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
  fyclasstype |
           1  |   5.118854   1.051973     4.87   0.000     3.049245    7.188462
           3  |   -.129948   .7790639    -0.17   0.868    -1.662646     1.40275
              |
   WhiteAsian |   5.898958   1.435242     4.11   0.000     3.075323    8.722593
         girl |   4.197232   .6567647     6.39   0.000      2.90514    5.489323
g3freelunch_2 |  -13.09894   .8149392   -16.07   0.000    -14.70222   -11.49566
WhiteTeacher3 |   .1128766   1.756599     0.06   0.949    -3.342984    3.568737
 MaleTeacher3 |   -6.86296   2.774812    -2.47   0.014    -12.32201    -1.40391
     g3tyears |   .0236603   .0634702     0.37   0.710    -.1012083    .1485289
         g3md |   .8444079   1.155211     0.73   0.465    -1.428306    3.117122
        _cons |   49.99601   2.300132    21.74   0.000     45.47082    54.52119
-------------------------------------------------------------------------------


.         
.  
.  
. 
end of do-file

